{
  "title": "Watch out for online contact with Chinese spies, UK defence minister warns public",
  "maintext": "Ordinary UK citizens need to watch out for online contact with Chinese spies, the defence minister has said, after MI5 issued an espionage alert to parliament.\nLuke Pollard said a warning given to parliamentarians on Tuesday that China was attempting to recruit individuals with access to sensitive information should also be heeded by the public at large.\nSecurity services took the unusual step of advising MPs, Lords and their staff to be alert to contact from spies, revealing two LinkedIn accounts that had been used to try to recruit those with access to non-public information.\n“That’s advice that should be heeded by the rest of the public as well,” he told Sophy Ridge on Sky News. “Because as we become more online as a community, the ability for people that wish us harm or wish us to gain access to information they shouldn’t have access to becomes more plentiful.”\nThe security services identified two accounts on LinkedIn going by the names Amanda Qiu and Shirly Shen, both purporting to be headhunters, which were thought to be linked to espionage.\nThe security minister, Dan Jarvis, said in parliament on Tuesday it was “a covert and calculated” attempt by the Chinese government to recruit people close to power.\nIn response, Beijing accused the UK spy agency of “groundlessly hyping up” the issue, and said it was not interested in “so-called intelligence” from the UK parliament.\nThe Chinese foreign ministry spokesperson, Mao Ning, told a press briefing on Wednesday: “China never interferes in other countries’ internal affairs and has no interest in collecting so-called intelligence from the UK parliament.”\nOne parliamentary worker who had been contacted by Shirly Shen told the BBC he had ignored the message but was concerned that less experienced staff might have responded to it.\nHe said: “The message wasn’t written in very good English, it was a message to say there was a job opportunity and was I interested, and to get in touch if I was.\n“I’ve worked around parliament for about 10 years now so I’m kind of used to this. But if you were more junior, you don’t know what you’re looking for. You might think it’s a genuine offer that’s made to you on LinkedIn, they might accept.”\nHe said he believed this kind of contact was becoming more common. “They have realised the way to get to parliamentarians is through their staff … it’s deeply worrying,” he said.\nIt comes not long after the collapse of a trial into alleged spying by two British people for China.\nChristopher Cash, a parliamentary researcher, and Christopher Berry, his China-based friend, were accused of espionage but the charges were dropped a month before the court case was due to begin.\nThe Crown Prosecution Service said it was forced to abandon the case after the government failed to provide reassurance that China was “a current threat to national security”, a threshold that needed to be met to go ahead with the prosecution.\nThe wording of the 1911 law around espionage refers to gathering information “directly or indirectly useful to an enemy”, a definition that could have strained the UK’s already fragile relationship with the superpower.\nPollard, who was doing the rounds on breakfast television and radio, said China posed “a number of threats” but it was a “complex picture”.\nHe said: “China poses a number of threats to the UK, but they also present a number of opportunities for the UK. It’s a complex picture with China, as I’m sure you’ve heard from government ministers over many weeks on this.”\nAppearing on the LBC radio breakfast show with Nick Ferrari, Pollard was challenged on the government’s purchase of Chinese technology, including vehicles used by the military that could contain listening devices.\nPollard told Ferrari the government was “looking carefully at what the options are with Chinese technology”.",
  "summary": null,
  "authors": [
    "Robyn Vinter",
    "www.theguardian.com",
    "robyn-vinter"
  ],
  "url": "https://www.theguardian.com/world/2025/nov/19/watch-out-online-contact-chinese-spies-uk-defence-minister-warns-public",
  "date_publish": "2025-11-19 09:44:17",
  "source_domain": "www.theguardian.com"
}