{
  "title": "HP seeking $1.7bn from Mike Lynch's estate",
  "maintext": "Hewlett Packard (HP) is seeking $1.7bn (£1.3bn) from the estate of Mike Lynch - who died last year when his yacht sank - over HP's acquisition of his firm Autonomy, the tech giant's lawyers have told the High Court.\nHP, now known as Hewlett-Packard Enterprise (HPE), bought Mr Lynch's tech firm Autonomy in 2011, but it says Mr Lynch and Autonomy's former chief financial officer, Sushovan Hussain, misrepresented the company's finances.\nIn a 2019 trial, HPE had accused Mr Lynch of inflating Autonomy's revenues which it said forced it to announce an $8.8bn write-down of the company's worth.\nMr Justice Hildyard ruled in 2022 that HPE had \"substantially succeeded\" in its claim, but that it was likely to receive \"substantially less\" than the $5bn it sought in damages.\nEarlier this year, he ruled that HPE suffered losses amounting to around £700m through the purchase of Autonomy.\nMr Lynch and his teenage daughter Hannah were among seven passengers and crew who died when the Bayesian went down off the coast of Sicily last August during a storm which caused the vessel to capsize and sink.\nA hearing in London, which began on Tuesday, will now decide whether Mr Lynch's estate can appeal against the 2022 and 2025 rulings.\nIn written submissions, Patrick Goodall, the barrister representing HPE, argued that Mr Lynch's estate was liable to pay $1.7bn, which includes around $761m in interest.\nHe said that Mr Lynch had \"not only perpetrated an enormous fraud, but lied about it at every stage\".\nHe said the claimants had spent almost £150m on the legal battle, and were seeking nearly £113m of their costs from Mr Lynch's estate.\nMr Goodall also said that Mr Lynch's estate should not be allowed to appeal against either the 2022 or 2025 rulings.\nIn written submissions, Richard Hill, the lawyer representing Mr Lynch's estate, said that the $761m in interest sought by the claimants was an \"excessive sum... based on a flawed analysis\" and that the \"legally and economically rational approach would provide for a materially lower figure\".\nThe claimants' position that \"they were the victors in this litigation\" was \"overly simplistic\", he added.\nMr Hill also said that Mr Lynch's estate should be allowed to appeal against the two earlier rulings, claiming that the judge \"erred in law\" and that there was a \"compelling reason for allowing the appeal to be heard\".\nA spokesperson for the Lynch family said: \"Today's hearing addresses technical matters that change nothing about the underlying substance of the case.\n\"The core facts remain that HP's claim was fundamentally flawed and a wild overstatement.\"\nIn a separate case, Mr Lynch was extradited to the US in 2023 to face criminal charges, and he was cleared of fraud charges in 2024.\nHe was celebrating being acquitted on his yacht when it sank.",
  "summary": null,
  "authors": [
    "BBC News"
  ],
  "url": "https://www.bbc.com/news/articles/cz7p4gynxlzo?at_medium=RSS&at_campaign=rss",
  "date_publish": "2025-11-18 22:40:41",
  "source_domain": "www.bbc.com"
}