{
  "title": "MI5's 'Chinese spies' alert and Trump defends MBS",
  "maintext": "Photos of a jubilant Scotland squad celebrating their World Cup qualifying win appear across the front and back pages. After 27 years, the Scottish Daily Mail says, \"Scots are finally on top of the world\". According to the Scotland edition of the Times, \"the roof nearly came off the stadium\" at the final whistle - while the Sun declares: \"Scotland are back.\"\nThe i Paper reports that suspected Chinese spies operating profiles on the networking site LinkedIn are connected to senior officials within the Home Office, the Foreign Office and Nato.\nAfter a warning from MI5 that those involved in politics were being targeted by China, a senior government figure tells the Times that they are sending a \"clear message to Beijing that we know what you are doing\".\nBut the Financial Times says the dispute \"threatens to strain further a relationship that Sir Keir Starmer has tried to improve\".\nA report which says the UK is under-prepared for an armed attack is highlighted on the front page of the Daily Telegraph.\nThe paper quotes the Commons' defence committee as saying that the government is moving at a \"glacial\" pace in the face of \"renewed threats from Russia and China\". The Ministry of Defence says it will set out its plans to bolster the UK's \"warfighting readiness\" later on Wednesday.\n\"Farage told me 'Hitler was right'\" is the headline in the Daily Mirror. It quotes a former classmate of Nigel Farage as saying he recalls him using racist taunts at school. The story originates in the Guardian, which says it has heard from more than a dozen people who accuse the Reform UK leader of \"deeply offensive behaviour\" throughout his teenage years.\nIn legal letters to the paper, Farage emphatically denies saying anything racist or antisemitic when he was a teenager. Reform UK says the allegations are \"entirely without foundation\", describing them as \"cynical attempts\" to smear the party and mislead the public.",
  "summary": null,
  "authors": [
    "BBC News"
  ],
  "url": "https://www.bbc.com/news/articles/cvg72zvp4dno?at_medium=RSS&at_campaign=rss",
  "date_publish": "2025-11-19 02:25:53",
  "source_domain": "www.bbc.com"
}