{
  "title": "MP's aide reported suspected China LinkedIn approach",
  "maintext": "When MPs, members of the House of Lords and their staff were warned about the threat from Chinese spies, in one office in Westminster, a quick check began.\nSimon Whelband is a Conservative councillor and also works for the Conservative MP Neil O'Brien, who was sanctioned by China in 2021.\nSimon went into his LinkedIn messages and there it was. A message from an account in the name of Shirly Shen sent some weeks earlier.\nHe hadn't responded to the unsolicited message and reported it to Parliament's security services. He was then advised to block the account.\nThe note comes across as pretty innocuous.\nHe said: \"The message wasn't written in very good English, it was a message to say there was a job opportunity and was I interested, and to get in touch if I was.\n\"I've worked around Parliament for about 10 years now so I'm kind of used to this.\n\"But if you were more junior, you don't know what you're looking for.\n\"You might think it's a genuine offer that's made to you on LinkedIn, they might accept.\"\nWhelband added that he thought it was becoming more common for those working in Parliament to be targeted by China.\n\"They have realised the way to get to Parliamentarians is through their staff... it's deeply worrying,\" he said.\nAnd so, for the second time this autumn, Westminster is collectively wrestling with what to do about China.\nThe growing influence of this vast superpower is one of the two stand out global changes of the last 30 years, alongside the growth of the internet.\nSome of the most acute challenges - or threats - from Beijing come when both of these mega-trends of the early 21st Century combine.\nSenior figures in government are worried, but express their worry carefully in public. MPs outside of government are much more willing to be blunt.\nTuesday's debate in the Commons on this was an eye opener. The security minister Dan Jarvis was both circumspect in his language, but warm and accepting of the wide range of concerns expressed by MPs of multiple parties.\nAmong them:\nConcern that buses manufactured in China but driving on British streets might be equipped with a so-called \"kill switch\" which allows someone in China to press a button and disable the bus – potentially causing chaos\nWorries about vehicles used by the military that are made in China and might be mobile listening devices – to such an extent that military figures have been warned to watch what they are saying when they are on board in case China is listening\nDeep concern about China seeking planning permission for a huge new embassy in central London which critics say will be a spying centre and is located very close to sensitive data cables that serve the City of London\nLast month, Parliament was digesting the collapse of a court case involving two men accused of spying for China, one of whom had worked in Westminster. Both men always denied any wrongdoing.\nNow it is the warning that all MPs and members of the House of Lords have received from the security service MI5 that they might be Beijing's next target.\nIt says it has identified two LinkedIn profiles used by Chinese security services to act as \"civilian recruitment headhunters\", targeting individuals working in British politics to solicit \"insider insights\".\nCommons Speaker Sir Lindsay Hoyle and his counterpart in the House of Lords, Lord McFall, circulated the warning to MPs and peers on Tuesday.\nThe alert specifically identified two LinkedIn profiles set up with the names Amanda Qiu and Shirly Shen.\nThe BBC has contacted both for a response, although it is not clear if the women named and pictured on the networking site are the actual account holders.",
  "summary": null,
  "authors": [
    "Chris Mason"
  ],
  "url": "https://www.bbc.com/news/articles/c1k091l2w1yo?at_medium=RSS&at_campaign=rss",
  "date_publish": "2025-11-19 05:01:13",
  "source_domain": "www.bbc.com"
}