{
  "title": "The forgotten war destroying women's lives",
  "maintext": "'It would have been better if they'd killed me': A forgotten war destroying women's lives\n6 hours ago\nBBC World Service\nWarning: This report contains descriptions of rape and sexual violence. Names of victims have been changed and identifying details omitted to protect their privacy and safety.\nEnat was at home with her eight-year-old niece when the soldiers came one Sunday morning, she says.\nThe Ethiopian army was carrying out searches of homes in the Amhara region on 5 January this year, as part of a crackdown on a growing rebellion launched by local militias known as Fano.\nEnat says three men, dressed in army uniform, entered her home in South Gondar and began asking questions about her family background and whether Fano fighters had visited the beer hall where she worked.\nEnat, 21, said they had.\n\"How could we lie? How can we hide the truth?\" Enat says, noting that Fano - an Amharic word loosely translated as volunteer fighters - is made up of locals.\nThings quickly escalated.\nAfter asking questions about her family background, Enat says the soldiers began insulting her, then threatened her niece with a gun when the little girl started crying.\nEnat says one of the soldiers then raped her in front of her niece while the others kept guard.\n\"I begged them not to hurt me. I called on the saints and begged them. But their hearts didn't pity me. They violated me.\"\nThousands of reports of rape and assault\nEnat, who is from the Amhara ethnic group, the second largest in Ethiopia, is among thousands of women believed to have been sexually assaulted and raped since the conflict between the Ethiopian army and Fano started in August 2023.\nSexual violence in the region is largely undocumented, but the BBC has collated data which shows there have been thousands of reports of rape between July 2023 and May 2025, with victims as young as eight and as old as 65.\nWhile restrictions have prevented independent media from entering Amhara to cover the conflict, the BBC team in Nairobi, in neighbouring Kenya, managed to speak to women and doctors in the region, offering a rare insight into the human impact of the crisis.\nThe conflict began when the government attempted to disband regional military groups, including those in Amhara, which had fought with the army during the 2020-2022 civil war in the next-door region of Tigray.\nFano militias felt betrayed by the move and believed it would leave them vulnerable to attack from Tigray and elsewhere, especially as violence against the Amhara community had intensified, according to rights groups.\nIn response, Fano launched a rebellion, seizing major towns. They claim to be fighting for regional autonomy and protecting their communities from marginalisation by the Ethiopian government.\nThe insurgency has resulted in a violent crackdown by the army, which calls Fano \"radical ethno-nationalists\".\nSince the conflict started, both sides have been accused of numerous human rights abuses, including extrajudicial killings, arbitrary detentions, forced displacement, destruction of property, looting and widespread cases of sexual violence, including rape.\nRights groups, including Amnesty International, say there is evidence the army is disproportionately responsible for the abuses. They also say that Amhara people in other parts of Ethiopia have been deliberately targeted by the security forces and other armed groups.\nBefore she was attacked, Enat had never had sex and planned to one day marry at her local church in a ceremony conducted in accordance with the Ethiopian Orthodox Church's rites, just as other women in her family had done.\nSuch marriages are among the most revered traditions of the Amhara people, who are predominantly Orthodox Christian, but it requires couples to remain \"pure\" and not have any sexual contact until marriage.\n\"Before that day, I had never known a man,\" she says.\n\"It would have been better if they had killed me.\"\n'My family found me unconscious'\nTigist, 18, from West Gojjam, also in the Amhara region, worked in her family's small, traditional teahouse before she was attacked.\nShe describes how, in January 2024, a soldier who was a regular customer groped her. She says she rejected him - an act she believes led to the attack.\nLater that evening, as she was returning home from work, she says three soldiers, including the man who groped her, ambushed her in the street and gang-raped her on the pavement.\n\"My family found me unconscious on the roadside,\" she recalls. \"They carried me to the clinic, where I spent five days.\"\nSince the attack, Tigist says she's been unable to leave her house, paralysed by fear of men and the outside world.\n\"My fear keeps me from going to work... Whenever I see soldiers or any men I panic and hide myself away.\"\nShe ended up retreating from her life and breaking off her engagement. She says she never told her fiance why or what happened.\nOverwhelmed by despair, Tigist attempted to take her own life, but her family intervened just in time and saved her. She says that although she has contemplated suicide since then, she has promised her family she will not try to kill herself again.\n'It is repulsive to have been born a woman'\nThe BBC collected data from 43 health facilities in Amhara - roughly 4% of all health facilities in the region - and other medical sources to get a snapshot of what has been happening.\nAt these facilities, there were 2,697 reports of rape between 18 July 2023 and May 2025. Children under 18 accounted for 45% of cases.\nJust over half of the victims tested positive for sexually transmitted infections (STIs), while many were also left pregnant and with severe psychological trauma.\nHowever, many victims of sexual violence never report the crime or seek treatment, fearful of stigma or of learning they may have contracted an STI or become pregnant.\nFor this reason, a senior health expert, who spoke to the BBC on condition of anonymity due to security concerns, says the victims who come to facilities in the Amhara region are only \"the tip of the iceberg\".\nLemlem is among those who have never reported their rape or sought medical treatment, terrified of learning that she might have a sexually transmitted infection, such as HIV.\nThe 23-year-old from South Gondar says government soldiers entered her house on 6 January to ask for information, a routine army practice.\nShe says when she didn't give them what they wanted, one of the soldiers raped her.\n\"He threatened me, saying: 'If you scream, one bullet is enough for you,'\" Lemlem says.\n\"I wept non-stop for a whole month. I couldn't eat. All I did was cry. I couldn't stand to walk. And I fell gravely ill.\"\nShe says the assault has driven her away from church, where she fears she may be the subject of gossip.\n\"It's repulsive to have been born a woman. If I were a man, they might have beaten me and walked away - they wouldn't have destroyed my life like this,\" says Lemlem, explaining how the trauma of the attack has made her feel about being female.\nMedics the BBC spoke to say there has been a sharp rise in the number of victims of sexual violence that they have been treating since the conflict began.\n\"They arrive trembling, too intimidated even to speak,\" one medic says.\nYet those who do come forward are reluctant to name their attackers and rarely seek justice, in part because the conflict has led to a breakdown in law and order. Instead, most who do seek medical assistance come out of fear of pregnancy.\nOthers seek treatment long after they have been attacked, by which point certain medications for the STIs they have contracted, such as HIV, are no longer effective.\nHIV can often be prevented with a treatment called post-exposure prophylaxis, but only if it is administered soon after sex with someone who was infected.\nAnother medic notes that many victims say they are unable to access treatment promptly due to transport disruption and road blockages caused by the conflict.\nA senior medic warns they fear a public health and social crisis could be looming.\nBased on information health centres have gathered, they say that they \"have identified signs that HIV infections may rise and that mental health and psychological problems could reach catastrophic levels\", noting that some victims have attempted suicide.\nFigures from Ethiopia's health ministry in 2022 showed that the HIV rate in the region was around 1.1 per 100 people - higher than the national average.\nWhile assaults have been carried out by both sides in the conflict, medical staff report seeing more cases involving Ethiopian army soldiers than Fano militia. A government employee with access to relevant information, who agreed to speak on condition of anonymity, also said this was the case.\nMost incidents of rape were reported in urban areas where the army maintains bases and exerts control, however experts point out that people living in cities have better access to treatment so are more likely to get help and report attacks.\nThe BBC was unable to interview any victims of assaults by Fano fighters due to limited access to places where the militia are based.\nIn June 2024, the UN Office of the High Commissioner for Human Rights reported that the Ethiopian National Defence Force, which includes the army, had perpetrated sexual violence, including against minors, in the Amhara region during the conflict with Fano militia.\nThe BBC asked Ethiopia's ministry of defence to respond to allegations, but despite months of waiting, we have not received a reply.\nRepeated BBC requests for detailed information from regional authorities were also unsuccessful.\nA Fano leader, Asres Mare Damtie, told the BBC the group was unaware of any involvement by its fighters, saying no accusations had been made against them and it enforces severe punishment, including death, for offenders.\nThe BBC has learned that a government-commissioned investigation led by Ethiopia's Bahir Dar University into conflict-related sexual violence against women in Amhara has begun, with findings expected to be released publicly in the coming months.\nIn 2021, when the army and its allies - which then included Fano - faced similar allegations over their conduct in the Tigray conflict, the government condemned the use of rape but dismissed the claims as \"biased and flawed\".\nTo date, no official action has been publicly disclosed against perpetrators.\nAmnesty International has raised concerns over what it believes is a persistent pattern of impunity in Ethiopia's army. \"There is no meaningful effort to bring perpetrators into justice,\" says the organisation's regional researcher, Haimanot Ashenafi.\n\"They're still fighting, they are still out there with no consequences for what they've done… survivors who have gone through this life-changing experience deserve justice.\"\nFor Enat, the consequences of her attack have been far-reaching.\nA month after the assault, she fled her village to escape the trauma of the attack.\nIt was then she learned she was pregnant as a result of the rape.\n\"I started vomiting,\" she recalls.\nShe thought of having an abortion, which is legally permitted in Ethiopia up to 12 weeks into pregnancy if a woman is raped, but she was scared.\n\"I feared God, and I felt for my mother. What would become of her if I died during the abortion?\"\nShe gave birth to a daughter in early September after three days of labour.\nDespite what happened to her, Enat considers the baby a \"gift from God\".\nBut she is currently living with a relative and is unable to work as she has to look after her daughter. She worries for the future and how she will provide for her child and herself.\n\"If this is what is considered to be living, then yes, I am living,\" she adds.\nIf you, or someone you know, have been affected by the issues raised in this story, details of organisations offering information and support are available at BBC ActionLine.",
  "summary": null,
  "authors": [
    "BBC World Service"
  ],
  "url": "https://www.bbc.com/news/articles/cx2p8dpw1rwo?at_medium=RSS&at_campaign=rss",
  "date_publish": "2025-11-19 04:05:03",
  "source_domain": "www.bbc.com"
}