{
  "title": "Miss Universe 2025 judge quits, claiming pageant is rigged",
  "maintext": "Two Miss Universe judges have resigned days before the annual beauty pageant, with one of them accusing organisers of rigging the selection process.\nLebanese-French musician Omar Harfouch, who announced his resignation from the eight-member jury on Instagram, alleged that an \"impromptu jury\" had pre-selected finalists ahead of the competition, set to be held on Friday in Thailand.\nHours later, French football manager Claude Makélélé also announced he'd pulled out, citing \"unforeseen personal reasons\".\nThe resignations come just weeks after several Miss Universe contestants walked out of a pre-pageant event over controversial comments made by an official from host nation Thailand.\n\"An impromptu jury has been formed to select 30 finalists from among the 136 participating countries, without the presence of any of the real [eight] members of the jury, including me,\" Mr Harfouch wrote in an Instagram post on Tuesday, saying he had discovered this via social media.\nThe unofficial jury comprises \"individuals with a significant potential conflict of interest due to some personal relationships with some of the Miss Universe contestants\", he claimed.\nMr Harfouch did not elaborate on how this \"impromptu jury\" would function, or how it would override the official jury's decision.\nThe Miss Universe Organisation on Tuesday put out a statement to rebuff Mr Harfouch's claims, saying that \"no external group has been authorised to evaluate delegates or select finalists\".\nIt suggested that Mr Harfouch may have been referring to the Beyond the Crown programme: a \"social impact initiative\" that operates independently from the Miss Universe competition, and has a separate selection committee.\nThe Miss Universe Organisation announced the Beyond the Crown selection committee on Monday. In its statement on Tuesday, the Organisation said that Mr Harfouch's allegations had \"mischaracterised\" the programme.\nMr Makélélé, who also announced his resignation via Instagram, described it as a \"difficult decision\".\n\"I hold Miss Universe in the highest regard. The platform represents empowerment, diversity, and excellence - values I have always championed throughout my career,\" he wrote.\nThe beauty pageant drew backlash earlier this month after its Thailand director Nawat Itsaragrisil publicly berated Miss Mexico, Fatima Bosch, at a pre-pageant event for not posting promotional content on her social media platforms.\nIn videos that have since gone viral, Ms Bosch and several other contestants could be seen walking out of the event, and some could be heard shouting at Mr Nawat.\nMr Nawat later claimed that some of his words were misunderstood - but his conduct nevertheless prompted a stern rebuke from Miss Universe Organisation, which has since sent a delegation of international executives to take over running the competition.",
  "summary": null,
  "authors": [
    "Kelly Ng"
  ],
  "url": "https://www.bbc.com/news/articles/crmxgymr8ewo?at_medium=RSS&at_campaign=rss",
  "date_publish": "2025-11-19 09:20:11",
  "source_domain": "www.bbc.com"
}