{
  "title": "Eswatini confirms receiving over $5m from US to accept deportees",
  "maintext": "Eswatini has confirmed for the first time that it had received more than $5m from the United States to accept dozens of people expelled under Washington’s aggressive mass deportation drive.\nThe tiny southern African kingdom has taken in 15 men since Donald Trump’s administration struck largely secretive deals with at least five African countries to accept migrants under a third-country deportation programme fiercely criticised by rights groups.\nA document revealed by Human Rights Watch in September and seen by AFP said Eswatini agreed to take 160 deportees in exchange for $5.1m to “build its border and migration management capacity”.\nQuestioned in parliament about the arrangement, the finance minister, Neal Rijkenberg, confirmed the government had received the $5.1m.\n“We were told it was for the US deportees after we enquired,” he said, adding the ministry had been kept in the dark throughout the process.\nThe first group of five men arrived in July aboard a chartered US military plane, with a second batch received in early October.\nWashington branded some of them “depraved monsters” convicted of crimes including child rape and murder.\nThey are being held without charge in Eswatini’s maximum-security Matsapha correctional centre, notorious for detaining political prisoners, according to their lawyers.\nOne of them, a 62-year-old Jamaican who had reportedly completed a murder sentence in the US, was sent back to Jamaica in September.\nLawyers and civil society groups in Eswatini have gone to court to challenge the legality of the detentions.\nRijkenberg told parliament the money received from the US was funnelled into the account of Eswatini’s disaster agency, NDMA.\nHowever, “NDMA is not allowed to use money it has not been appropriated,” he said, vowing to regularise the process.\nIt was not immediately clear who from Eswatini signed the deal with the United States.\nFormerly known as Swaziland, the country is the last absolute monarchy in Africa. It has been led by King Mswati III since 1986 and his government has been accused of human rights violations.",
  "summary": null,
  "authors": [
    "Guardian staff"
  ],
  "url": "https://www.theguardian.com/world/2025/nov/17/eswatini-5-m-dollars-us-deportees",
  "date_publish": "2025-11-17 17:47:41",
  "source_domain": "www.theguardian.com"
}