{
  "title": "Ternopil attack kills 10 in one of Russia's deadliest attacks on western Ukraine",
  "maintext": "At least 10 people have been killed and dozens more wounded in a Russian attack on two blocks of flats in the western city of Ternopil, says Ukraine's interior minister Ihor Klymenko.\nAmong the wounded were 12 children, Klymenko said, in one of the deadliest Russian strikes on western Ukraine since the full-scale war began in February 2022.\nTwo other western regions were hit, Lviv and Ivano-Frankivsk, and a drone attack targeted three districts of the northern city of Kharkiv, wounding more than 30 people. Photos posted online showed buildings and cars ablaze.\nPower cuts were affecting a number of regions across the country, Ukraine's energy ministry said.\nA giant smoke cloud rose in the distance behind the Church of Our Lady of Perpetual Help in Ternopil, as sirens blared throughout the city.\nEnergy facilities, transport and civil infrastructure were damaged elsewhere in western Ukraine.\nThe energy sector came under attack in Ivano-Frankivsk region where two of three people reported wounded were children.\nThe head of Lviv region said an energy facility had been struck.\nThe Russian strikes came a day after Ukraine's military said it had fired US-supplied longer-range Atacms missiles at military targets inside Russia, the first time they have admitted using the Atacms on Russian soil.\nRussia's defence ministry accused Ukraine of firing four of the missiles at the southern city of Voronezh but said they had all been shot down by air defences.\nMeanwhile, Zelensky is heading to the Turkish capital Ankara, in an attempt to revive a US bid to end the war. He will hold talks with Turkish President Recep Tayyip Erdogan amid reports that President Donald Trump's special envoy Steve Witkoff has been working on a plan with Russian counterpart Kirill Dmitriev.\nThe Kremlin said no Russian representative would be joining the talks in Ankara. Spokesman Dmitry Peskov declined to comment on a media report that the US and Russia had been secretly working on a peace plan for Ukraine.\n\"In this case, there is nothing new that we can inform you about,\" Peskov told journalists on Wednesday.\nHis comments came amid reports that Zelensky was due to meet two top US army officials in Kyiv on Thursday. Army Secretary Dan Driscoll and Army Chief of Staff General Randy George are the most senior US military officials to visit the Ukrainian capital since President Donald Trump took office, Reuters reports.\nIn a separate development, Romania's defence ministry said a Russian drone had flown for about 8km (5 miles) through its airspace in the early hours of Wednesday. The drone then crossed into Ukraine and Moldova before returning to Romania, it said.\nRomanian and German air force planes were scrambled in response to the incursion and the defence ministry said it was unclear where the drone had come down.\nPoland also deployed jets early on Wednesday and temporarily closed two airports in the southeast in response to the strikes in western Ukraine.\nAs the fourth anniversary of the start of Russia's full-scale invasion approaches next February, Moscow and Kyiv remain fundamentally opposed in their views of how to end the war.\nEarlier this month Russian Foreign Minister Sergei Lavrov said that Russia's conditions for a peace deal had not changed since Putin laid them out in 2024.",
  "summary": null,
  "authors": [
    "Mattea Bubalo"
  ],
  "url": "https://www.bbc.com/news/articles/cy0yere4k0zo?at_medium=RSS&at_campaign=rss",
  "date_publish": "2025-11-19 07:50:26",
  "source_domain": "www.bbc.com"
}