{
  "title": "How the viral Baby Shark video created a $400m business",
  "maintext": "Baby Shark: How a 90-second clip created a $400m business\n11 hours ago\nOsmond ChiaBusiness reporter\nWhen Kim Min-seok gave the go-ahead in June 2016 to publish a 90-second clip of a children's song, he had no idea what he was unleashing.\nIt became a global phenomenon, clocking up more than 16 billion views - YouTube's most watched video ever.\nThat song was the incredibly catchy Baby Shark.\nNot only has it captivated toddlers and terrorised adults around the world, it laid the foundations for its creator Pinkfong to become a media business worth hundreds of millions of dollars.\n“We didn’t expect it to stand out from our other content,\" Mr Kim, Pinkfong's chief executive, told the BBC from the firm's headquarters in Seoul.\n\"But looking back, it became a major turning point that set the stage for our global journey.”\nOn Tuesday, that journey took Pinkfong to the South Korean stock market, where its shares rose by more than 9% on their debut, giving it a valuation of more than $400m (£304m).\n'We didn't expect a salary'\nFounded in 2010 as SmartStudy, the firm made digital content for children up to 12 years of age.\nIt had just three employees, including Mr Kim and the firm's chief technology officer, Dongwoo Son.\n\"The office was tiny - even smaller than this,\" recalled Mr Kim, gesturing to the conference room he was calling from.\nIt was so small \"we didn't even expect a salary at the time\", he said through a translator.\nPinkfong went through several major overhauls, including shifting its focus to toddlers.\nThe firm grew to around 100 employees and prioritised simpler, learning-based games and content. \"And that's when Baby Shark emerged,\" Mr Kim said.\nThe firm has been known as The Pinkfong Company since 2022, a name inspired by a cheerful and curious fox that featured in one of its early cartoons.\nIt now has around 340 employees, with offices in Tokyo, Shanghai and Los Angeles.\nThe Baby Shark moment\nBaby Shark is believed to have originated in the US in the 1970s and was often sung at children's summer camps.\nThe song, which repeats the phrase \"Baby shark, doo, doo, doo, doo, doo, doo\" is \"attractive for children, though possibly annoying for adults,\" said media analyst Kevin Chew from the Nanyang Technological University.\nMr Kim is also very aware of just how catchy it is.\n\"It's like a K-pop song. It's very fast-paced, rhythmical and it's addictive,\" he said, adding that the tune has a \"chanting\" effect, which makes it easy for children to remember.\nBut it was not an instant hit and only gained traction when its dance routine was featured at children's events in South East Asia.\nVideos of children and adults dancing to the song started to spread online and the clip went viral.\nThere was a \"festival-like feeling\" in the Pinkfong office, as the team watched its viewing numbers soar, Mr Kim said.\nIn November 2020, the Baby Shark clip claimed the title of YouTube's most viewed.\nIt generated around half of the firm's revenue in the years immediately after the video's release and became a springboard for new content and merchandise, he said.\nBut Pinkfong faced a legal challenge in 2019 when it was accused of plagiarising the work of an American composer.\nSouth Korea's Supreme Court rejected the case, after the company argued that its version was derived from a folk song in the public domain.\nThe victory, Mr Kim said, gave the firm a lift as its shares went public. He added that the stock market application had been filed before the verdict was announced.\nOne-hit wonder?\nPinkfong's other franchises like Bebefinn and Sealook are growing fast but the firm must prove its success is not just reliant on Baby Shark, said Korea University business lecturer Min Jung Kim.\nThe company's target audience is a major plus as toddlers tend to watch the same material repeatedly, she said.\nKim Min-seok insists his business can grow beyond Baby Shark, which currently accounts for about a quarter of Pinkfong's revenue. Meanwhile, Bebefinn has leapt ahead, generating roughly 40% of the firm's earnings.\nOne parent told the BBC that his family has mixed feelings about Pinkfong's videos.\nFather of two Saleem Nashef said he appreciates the educational qualities of the firm's content but his wife thinks Baby Shark is \"too over-stimulating for kids\".\nStill, the viral video is apparently inescapable, as his daughter, who is about to turn three, will have a Baby Shark-themed birthday party.\nWhether Pinkfong can create other characters to match Baby Shark's commercial appeal remains unclear, said Prof Kim.\nIt raised almost $52m in its stock market debut and plans to use the money to expand its line-up of films and characters, said Mr Kim.\nThe company also aims to become a \"tech-driven\" content creator, using viewing patterns and other data to shape its new projects.\nPinkfong has already achieved \"what many creators have always dreamed of,\" Mr Kim said.\nBut now it must show investors that it is not just a one-hit wonder.",
  "summary": null,
  "authors": [
    "Osmond Chia"
  ],
  "url": "https://www.bbc.com/news/articles/cn8xzgw623go?at_medium=RSS&at_campaign=rss",
  "date_publish": "2025-11-18 23:00:46",
  "source_domain": "www.bbc.com"
}