{
  "title": "Sheinbaum again dismisses Trump’s threat of sending troops to Mexico: ‘We do not want intervention’",
  "maintext": "Mexico’s president, Claudia Sheinbaum, has again dismissed Donald Trump’s threat of military action against drug cartels inside her country, telling reporters: “It’s not going to happen.”\nSheinbaum made the comments on Tuesday morning in response to the US president’s latest warning that he could authorise strikes in Mexico.\n“Would I want strikes in Mexico to stop drugs? OK with me, whatever we have to do to stop drugs,” Trump said on Monday, adding that he’s “not happy with Mexico” and that the US government has drug corridors from Mexico “under major surveillance”.\nSheinbaum said that the Trump administration later clarified it would only intervene with Mexico’s permission.\n“We are not going to ask for it because we do not want intervention from any foreign government,” she said.\nSheinbaum pointed to the 19th-century Mexican-American war as a warning of what could happen if US troops were allowed into Mexico: “The last time the United States came to intervene in Mexico, they took half of the territory.”\nSheinbaum, who took power a few months before Trump returned to the White House, has received plaudits for her calm but firm handling of bilateral relations under intense pressure.\nEarlier this month, she denied reports that Washington planned to send troops into Mexico, noting that she had repeatedly rejected such offers from Trump. “We do not agree with any process of interference or interventionism,” she said.\nNonetheless, Trump continues to demand that Mexico, the largest trade partner of the US, do more to reduce the flow of drugs and migrants across the US-Mexico border.\n“I have great respect for the president, a woman that I think is a tremendous woman,” Trump said of Sheinbaum in October. “She’s a very brave woman, but Mexico is run by the cartels.”\nTrump’s latest threat comes as he amasses an armada that includes the USS Gerald Ford, the world’s largest aircraft carrier, in the southern Caribbean, close to Venezuela.\nTrump says the deployment is needed to stop the flow of drugs to the US. The US military has blown up 21 alleged drug-trafficking boats since September, killing at least 83 people.\nBut many analysts see it as a way to pressure the Venezuelan president, Nicolás Maduro, to step down after stealing last year’s election.\nTrump’s threats against Mexico and Venezuela reflect his administration’s new and aggressive focus on Latin America.",
  "summary": null,
  "authors": [
    "Thomas Graham",
    "www.theguardian.com",
    "thomas-graham"
  ],
  "url": "https://www.theguardian.com/world/2025/nov/18/claudia-sheinbaum-us-military-mexico-trump",
  "date_publish": "2025-11-18 17:46:23",
  "source_domain": "www.theguardian.com"
}