{
  "title": "Venezuela’s top opposition leader claims ‘new era’ is coming despite lack of clear plan",
  "maintext": "Venezuela’s top opposition leader, the Nobel laureate María Corina Machado, has declared her country “at the edge of a new era” as Donald Trump refused to rule out a ground invasion to topple its authoritarian leader, Nicolás Maduro, but also signalled he was open to talks.\nMachado, who has lived in hiding since her movement’s candidate was widely believed to have beaten Maduro in last year’s presidential election, made her claim in a “freedom manifesto” that was published on Tuesday as uncertainty continued to shroud the South American country’s future.\n“This regime’s long and violent abuse of power is ending. A new Venezuela is emerging from the ashes, renewed in spirit and united in purpose, like a phoenix reborn – fierce, radiant, and unstoppable,” wrote Machado, who claims to have a plan for the first 100 hours and 100 days after Maduro leaves power.\nMachado, who has not provided specific details of those plans, claimed a change of regime would protect Venezuela from “future oppressive tyrannies, dictatorships, and despots” and create a country where government opponents could “walk from the shadows without dread”.\n“The criminal regime must be held accountable,” for its brutality, added Machado, 58, a conservative politician who was the surprise winner of last month’s Nobel peace prize.\nShe predicted Venezuela was poised for a “rebirth” after years of economic chaos, environmental destruction, violence and a mass exodus that has seen an estimated 8 million Venezuelans flee overseas. “We will bring them home,” Machado vowed.\nBut such claims have been made many times before and it remains unclear how Machado and her allies plan to fulfil their longstanding quest to force Maduro, who has ruled since 2013, from power.\nSince August, Trump has ordered a massive naval buildup off Venezuela’s northern coast, seemingly hoping to spark a military rebellion against Maduro or convince him to quit. The state department announced a $50m reward for information leading to Maduro’s arrest – twice the value offered for the capture of the al-Qaida leader Osama bin Laden. On Sunday, the world’s largest aircraft carrier, the USS Gerald R Ford, arrived in the Caribbean Sea. “Trump has put the gun on the table,” his former national security adviser, John Bolton, told CNN. “The question now is, is he going to use it against Maduro or not?”\nSo far, however, there has been no inkling of a split in Maduro’s regime and Trump has yet to pull the trigger on further military action.\nSpeculation that Trump was poised to order airstrikes on Venezuela reached fever pitch last weekend. “Lots of people – even high up in the opposition … were convinced that it was about to happen, that bombs were about to fall,” said Phil Gunson, a Caracas-based analyst for the International Crisis Group, adding: “[But] the bombs didn’t fall.”\nOn Sunday, Marco Rubio, the US secretary of state, announced that as of next Monday, the US would declare the Cartel of the Suns – the supposed drug cartel it accuses Maduro of running – a foreign terrorist organization, offering a potential justification for an attack. Some observers read that move as an ultimatum for Maduro to decide on his future within the week.\n“But we know that for Trump these deadlines don’t mean a lot. He blows through deadlines – or he short-circuits them by acting as he did in the case of Iran, [launching his June strikes on its nuclear sites] while the clock was still ticking on his deadline,” Gunson added.\nOn Monday, Trump refused to dismiss the possibility of putting boots on the ground in Venezuela – and said he didn’t “rule out anything” – but also anticipated negotiating with Maduro. “I probably would talk to him, yeah. I talk to everybody,” the US president said.\nThe ratcheting up of the pressure has left many South American governments on edge, fearing chaotic repercussions and bloodshed if Maduro’s regime is brought down. Given Trump’s well-known aversion to sending US troops abroad, many suspect that even if Maduro is removed – and key opposition leaders can fly home from exile – the new US-backed government will struggle to control a potentially volatile security situation or the start of an insurgency.\nOthers believe that even if Maduro falls, his shoes might simply be filled by another even more unsavoury authoritarian.",
  "summary": null,
  "authors": [
    "Tom Phillips",
    "www.theguardian.com"
  ],
  "url": "https://www.theguardian.com/world/2025/nov/18/venezuela-new-era-maria-corina-machado-trump",
  "date_publish": "2025-11-18 15:50:46",
  "source_domain": "www.theguardian.com"
}