{
  "title": "Nestlé accused of ‘risking health of babies for profit’ over added sugar in cereals sold in African countries",
  "maintext": "Nestlé is still adding sugar to most baby cereals sold across Africa, according to an investigation by campaigners who have accused the company of “putting the health of African babies at risk for profit”.\nThe food firm was accused of “double standards” over the researchers’ findings, which come at a time when rates of childhood obesity are rising on the continent, prompting calls for Nestlé to remove all added sugar from baby-food products.\nNestlé described the investigation, from Public Eye, a Swiss group that calls itself a global justice organisation, as “misleading”. A company spokesperson said that having cereals sweet enough to be palatable to infants was vital in combating malnutrition. The firm said their recipes were well within limits set by national regulations in the countries concerned.\nPublic Eye researchers worked with activists in more than 20 African countries to buy 94 samples of Cerelac products marketed for babies aged six months and above, which were sent to a laboratory for analysis.\nThe laboratory found added sugar in more than 90% of baby cereals, with an average of 6g, or one-and-a-half teaspoons, per serving.\nMost products without added sugar were imported, they said, and had originally been intended for sale in Europe, apart from two variants recently launched in South Africa.\nThe amount of added sugar identified ranged from about 5g a serving for products found in Egypt, Madagascar, South Africa, Malawi and Nigeria to 7.5g in a product sold in Kenya.\nWorld Health Organization (WHO) guidelines on foods for children under three recommend they should contain “no added sugars or sweetening agents”, in part because of the risk of creating long-term preferences for sweetened foods.\nAn investigation by Public Eye published in April 2024 found Nestlé was adding sugar and honey to infant milk and cereal products sold in Asia, Africa and Latin America, when equivalent products in richer countries had no added sugar.\nIn a letter to Nestlé’s chief executive, Philipp Navratil, 19 African civil society and consumer organisations said: “You know how to do things differently. But you made a deliberate decision to feed children in Africa with less healthy options.”\nAfter Public Eye’s 2024 investigation, Nestlé said it had an ambition to introduce versions of Cerelac with no added sugar in all markets. However, campaigners said this was “too little, too late”, and called for the company to stop adding sugar to baby foods.\nThey added: “By adding sugar to infant cereals, Nestlé is putting the health of African babies at risk for profit.” Accusing the firm of playing a part in “a preventable public health catastrophe”, they said an epidemic of diet-related non-communicable diseases was spreading across the continent.\nPeggy Diby, global head of corporate affairs for Nestlé Nutrition, said: “These are unfounded allegations and insinuate actions that are contrary to all our values. We disagree with the Public Eye report. It is misleading. We do not have double standards when it comes to early childhood nutrition.”\nIn the past year, Nestlé has introduced 14 Cerelac variants with no added sugar in India, and Diby said it was accelerating the rollout of no added sugar varieties in African countries.\nShe said Public Eye had refused to share details of its testing, and disputed the sugar levels identified, suggesting they included naturally occurring sugars from milk, cereals and fruits in the products. She said levels in Nestlé products were “well below” those set out in international food safety and quality standards published by the WHO and the UN’s Food and Agriculture Organization known as the Codex Alimentarius.\n“The biggest challenge in Africa is not obesity, it is malnutrition,” she said, highlighting iron deficiency as a particular concern. “We are here to provide age-adapted solutions that contribute to [tackling] malnutrition.”\nDr Sara Colombo Mottaz, global head of medical, regulatory and scientific affairs at Nestlé Nutrition, said fortified cereals played a key role in providing the necessary micronutrients, and the company had internal “guardrails” to keep added sugars below a certain level.\nShe said babies in the womb, or those breastfed as infants, were used to sweet tastes and it was important to offer them flavours they would accept as they transitioned to solid foods.\n“We want to provide to parents [a range of products] that are under also our guardrail,” she said. “Remember that children at the age of six months … can refuse to eat and if they refuse to eat, they will not be able to grow properly.”",
  "summary": null,
  "authors": [
    "Kat Lay",
    "www.theguardian.com",
    "kat-lay"
  ],
  "url": "https://www.theguardian.com/global-development/2025/nov/17/nestle-accused-of-risking-health-of-babies-for-profit-over-added-sugar-in-cereals-sold-in-african-countries",
  "date_publish": "2025-11-17 23:00:17",
  "source_domain": "www.theguardian.com"
}