{
  "title": "Line of Duty to return for seventh series, BBC confirms",
  "maintext": "Police drama Line of Duty is to return to the BBC for a seventh series, with Adrian Dunbar, Vicky McClure and Martin Compston all set to reprise their roles in the hit show.\nA new six-part series, written by creator Jed Mercurio, will begin filming in Belfast in the spring, the BBC confirmed.\nMcClure said she was \"so excited\" the series was returning, with Dunbar adding: \"What a joy it is to know that the Three Amigos will be back filming together next year.\"\nThe last series concluded in 2021 with a finale that attracted more than 17 million viewers. Speculation about a return has been rife ever since, but Mercurio and the BBC have not confirmed it until now.\nThe BBC has not yet announced when the new season will hit screens.\nThe finale of series six drew the show's long-running storyline about the hunt for criminal mastermind known as \"H\" to a close, and the BBC and creative team behind the show said at the time there were no plans for any further series.\nHowever, the corporation confirmed on Tuesday that a seventh series is now in development.\nA new character, Det Insp Dominic Gough, a charismatic officer celebrated for a string of takedowns of organised crime, is accused of abusing his position to act as a sexual predator.\nBut his case could be a deliberate distraction from a bigger threat still operating in the shadows, the announcement teased.\nIn a statement, Mercurio said: \"Everyone involved in Line of Duty feels enormous gratitude to the show's fans.\n\"We're privileged to have had so many of you follow the ups and downs of AC-12 over six previous seasons and we couldn't be more delighted to be returning for a seventh.\"\nHe added: \"Corruption in this country is supposed to have come to an end while Line of Duty was off air so I've been forced to use my imagination.\"\nLine of Duty launched in 2012 and went on to become one of the most popular TV drams of the last decade, attracting guest stars such as Stephen Graham, Thandiwe Newton, Kelly Macdonald and Lennie James.\nCompston described appearing in the police drama as \"a job of a lifetime\".\n\"Not only in terms of the show's success but the people I've had the opportunity to work with I now call some of my closest friends.\n\"I can't wait to pull the waistcoat on again and get the team back together,\" he said.\nMcClure added: \"It goes without saying I'm so excited Line of Duty is back! Can't wait to work with Jed, Martin and Adrian again. Belfast, we'll see you soon!\"\nDunbar remarked: \"As we count down the AC-12 days of Christmas what a joy it is to know that the Three Amigos will be back filming together next year.\n\"Delighted with the news and looking forward to those mercurial twists and turns.\"",
  "summary": null,
  "authors": [
    "Steven McIntosh"
  ],
  "url": "https://www.bbc.com/news/articles/cev1r8vee0eo?at_medium=RSS&at_campaign=rss",
  "date_publish": "2025-11-18 19:12:58",
  "source_domain": "www.bbc.com"
}