{
  "title": "Loose wire on ship may have led to Baltimore bridge collapse, report says",
  "maintext": "A loose wire on a cargo ship caused a power outage that may have led to the 2024 deadly collapse of Baltimore's Francis Scott Key Bridge, US investigators have said.\nThe Dali container ship, which crashed into the bridge and left six workers dead, was \"preventable\", National Transportation Safety Board (NTSB) investigators said during a hearing on Tuesday.\nPolice stationed at the bridge's ends were notified that the ship had veered off course but did not call the construction team's inspector to warn them.\nHad the six workers been notified when police were, the NTSB said, they may have had time to evacuate.\n\"There would have been about one minute and 29 seconds to evacuate\" before the collision, said NTSB engineer Scott Parent, according to the Washington Post.\nThat could have been \"sufficient time to drive to a portion of the bridge that did not collapse\", he said.\nIn the black of night on 26 March 2024, several vehicles on the Scott Key bridge plunged into the icy waters of the River Patapsco in Baltimore, Maryland, after the Dali container ship crashed into one of its pillars. Six workers fell to their deaths.\nTuesday's hearing unveiled the potential causes behind the deadly tragedy, as outlined in the NTSB's year-long investigation.\nThe agency identified multiple factors, including the loss of electrical power from a faulty cable, problems with a fuel pump on the ship and a lack of counter measures to reduce the bridge's vulnerability. The NTSB also reviewed its safety recommendations.\nThe findings confirmed those of a 2024 NTSB preliminary report, which had cited faulty cables as the likely cause of an electrical blackout on the Dali in the final moments before collision.\n\"This tragedy should have never occurred. Lives should have never been lost. As with all accidents we investigate, this was preventable,\" NTSB Chairwoman Jennifer Homendy said at the hearing.\nThe deadly incident was massively disruptive to the major US shipping Port of Baltimore while it was closed, and severed part of a major interstate roadway.\nOfficials preliminarily estimated the repairs would be completed by 2028 and cost roughly $1.9bn (£1.4bn). However, an update on Monday estimated the total cost of repairs to be closer to $5bn and moved the timeline for completion to 2030.\n\"Just as families across the country are dealing with the reality of increased costs, so is Maryland,\" the state's Democratic Governor Wes Moore said in a statement on Monday.\n\"Trade policies out of Washington, D.C. have raised prices on everything - including essential materials we need in order to rebuild the Francis Scott Key Bridge.\n\"Still, despite this new economic reality, our resolve is unwavering,\" he said.",
  "summary": null,
  "authors": [
    "Brandon Drenon"
  ],
  "url": "https://www.bbc.com/news/articles/cqjw52p58geo?at_medium=RSS&at_campaign=rss",
  "date_publish": "2025-11-18 20:45:51",
  "source_domain": "www.bbc.com"
}