{
  "title": "World Cup qualifying: Robertson on Jota plus McGinn, Tierney, Ferguson & McLean reaction",
  "maintext": "Glasgow nightclubs, red wine with Kenny Dalglish, and an incredibly moving tribute to the late Diogo Jota all came to mind for Scotland captain Andy Robertson.\nJohn McGinn spoke of the emotional torment of an epic night at Hampden. Craig Gordon reflected on his lengthy injury woes. And Lewis Ferguson was thinking of his wee girl on her birthday.\nThe Scotland players talked, and talked, and talked after sealing a place in the men's World Cup for the first time since 1998 with a scarcely believable 4-2 victory over group favourites Denmark.\nScott McTominay scored one of - if not - the greatest Scotland goals ever, while Kieran Tierney and Kenny McLean both struck beauties of their own in injury time to seal one of the great wins at the national stadium.\nWild celebrations followed those two strikes and continued long past the final whistle as players and fans contributed to joyous scenes in Glasgow's southside.\nBut how did Scotland's heroes sum it all up in the immediate aftermath?\nScotland captain Andy Robertson paid tribute to former Liverpool team-mate Diogo Jota, who died last summer in a road traffic accident.\n\"I've hid it well, but today I've been in bits,\" the 31-year-old said. \"I know the age I'm at, this could be my last chance to go to the World Cup.\n\"I couldn't get my mate Diogo Jota out of my head today. We spoke so much about going to the World Cup because he missed the last one with Portugal and I did with Scotland. I know he'll be smiling over me today.\n\"I'm so glad it's ended up this way. This group of boys, this group of staff - it's the best group I've been involved in.\n\"The manager's speech before the game was unbelievable. He went through the big moments we've had. Qualifying for the Euros - he couldn't quite remember - we were in Wunderbar. He said 'let's make it another one'.\n\"We were quite emotional. To do it for him, the staff and all our families, it'll go down as one of the greatest nights of my life.\n\"That just sums up this squad. Never say die. We just keep going right to the end and one of the craziest games. We put the country through it, but I'm sure it's worth it. We're going to the World Cup.\nAnd, addressing BBC Scotland anchor Kelly Cates, Robertson added: \"I can't wait to get back down to Liverpool to have a red wine with yer da.\"\nScotland midfielder John McGinn described the displays in the last international break as \"jobby\" performances and conceded that this wasn't all that much better.\nBut the end more than justified the means.\n\"I thought we were pretty rubbish to be honest, but who cares?\" he said. \"To get over the line was such an amazing feeling. The gaffer's team talk was exceptional.\n\"It's a privilege every time we meet up. It's just humble guys wanting to do well for their country. We left everything out there.\n\"You think that's it - glorious failure, another blow. I was thinking about the play-offs in the 91st minute. But then what a hit from KT - I will never feel like that in a football stadium ever again.\"\nScotland were heading for the play-offs until substitute Tierney curled a magnificent shot beyond the despairing dive of Denmark goalkeeper Kasper Schmeichel in the 93rd minute.\n\"It's mental, man,\" the Celtic defender said. \"One of the best feelings ever. This group, the staff, everyone deserves it. Too good to be true, honestly. I don't know what I did for my celebration. What a night.\"\nAnd McLean capped the evening off by lobbing Denmark goalkeeper Kasper Schmeichel from inside his own half, having come off the bench to replace the injured Ben Gannon-Doak in the first half.\n\"The atmosphere in here, the whole place deserves it,\" he said. \"It's been a long time. We knew we had the ability to do it, but to do it late on feels a bit more special.\n\"The finish, KT just said 'you scored the third best goal of the game and it was a belter'.\n\"I thought about [shooting] twice. The keeper didn't drop too quickly so I took a pop. To see it go in that inside post, it's the best feeling I've had. It tops Norway.\"\nTuesday was already a special day for midfielder Lewis Ferguson before the events at Hampden.\n\"It's my daughter's third birthday today and I was a wee bit gutted I didn't get to spend it with her, but it was all worth it to see her at the end,\" he said.\n\"I'm so happy and so proud. It will probably sink in tomorrow when we're all hungover. I've grown up never seeing Scotland at a major tournament, never at a World Cup, but we've topped the group.\"",
  "summary": null,
  "authors": [
    "George O'Neill",
    "www.facebook.com"
  ],
  "url": "https://www.bbc.com/sport/football/articles/czdr921gm08o?at_medium=RSS&at_campaign=rss",
  "date_publish": "2025-11-19 00:58:06",
  "source_domain": "www.bbc.com"
}