{
  "title": "The rainforest the world forgot: the Congo basin is the second largest on Earth, so why is it being neglected?",
  "maintext": "In October 2023, leaders, scientists and policymakers from three of the world’s great rainforest regions – the Amazon, the Congo, and the Borneo-Mekong basins – assembled in Brazzaville, capital of the Republic of Congo. They were there to discuss one urgent question: how to save the planet’s last great tropical forests from accelerating destruction.\nFor those present, the question was existential. But to their dismay, almost no one noticed. “There was very little acknowledgment that this was happening, outside of the Congo basin region,” says Prof Simon Lewis, a lecturer at the University of Leeds and University College London, and co-chair of the Congo Basin Science Initiative (CBSI).\n“It didn’t really fly as a conference or a set of policy proposals to better invest in that region of the world.”\nDespite being the second-largest rainforest on Earth – and one of the most vital carbon sinks – the Congo basin remains the rainforest the world forgot, often overlooked when it comes to global climate policy and funding.\nSpanning six countries across central Africa and home to roughly 130 million people, the basin is often called the “lungs of Africa”. Its vast canopy shelters thousands of rare species.\n“It has about 10,000 plant species and 30% of these can only be found in the region,” says Dr Yadvinder Malhi, a leading ecologist at Oxford University. Unlike the Amazon, the Congo’s forests remain largely intact – home to endangered animals such as forest elephants, okapis, mountain gorillas and bonobos.\nIts significance extends far beyond its borders. The basin’s rainfall feeds main river systems across the continent, sustaining life as far away as the Sahel.\n“Africa is largely an arid continent,” says Malhi. “This fountain of water in the heart of the continent circulates and [also] ends up feeding into the Nile. That sustains the lives of millions of people.”\nCrucially, while encroachments of logging and mining are increasing, much of the forest remains untouched. As a result, the Congo basin is believed to be the last big rainforest to remain a strong carbon sink – with enough trees left to absorb more carbon than it emits.\n“It’s what we believe,” says Lewis. “But we are lacking recent data to see if that is still the case. We know carbon-absorption rates have declined in the Amazon in the last decade or so, but we’re not sure what’s happening in the Congo now.”\nIn a report released on Monday, as the Cop30 climate conference began in Belém, the Science Panel for the Congo Basin found that the Congo basin absorbs 600m tonnes of carbon dioxide a year, but this number is falling due to accelerating deforestation. Prof Bonaventure Sonké, co-chair of the panel, said the researchers hoped it would bring international attention and support for “the Earth’s most important but least-studied tropical rain forest”.\nWhile scientists agree on the Congo basin’s critical importance, it continues to be funded at a far lower rate than its counterparts. A report published earlier this year by the Centre for International Forestry Research and World Agroforestry (CIFOR-ICRAF) revealed the scale of the financial imbalance.\nBetween 2008 and 2022, the world’s three main rainforest regions received a combined total of $20bn (£15bn) in international funding. Of that, $9.3bn (47%) went to the Amazon basin, $7.4bn (37%) to south-east Asia, and only $3.2bn (16%) to the Congo basin.\nGermany was the leading donor for central Africa during this period, providing 24% of total funding, followed by the Global Environment Fund (12%), the World Bank (9.4%), and the US (8.8%). Most of the money (30%) went towards biodiversity protection, with another 27% supporting environmental policy. Yet funding for scientific research accounted for just 0.1%.\n“The basin countries don’t prioritise research,” says Dr Richard Sufo Kankeu, a scientist at ​CIFOR-ICRAF​ and one of the report’s authors.\nThe result is a wide gap in scientific understanding. A 2023 study examining relative levels of climate and biodiversity research on different rainforests found about 2,000 published academic papers for the Congo basin, compared with 10,611 for the Amazon.\n“You’ve got this critical ecosystem, but there just aren’t enough local scientists working to understand it,” says Lee White, an honorary professor at the University of Stirling and former environment minister in Gabon.\nWhite and Lewis have recommended that Congo basin countries aim to train at least 1,000 PhD-level scientists over the next decade to strengthen regional expertise. But better funding is also needed now.\n“We don’t want to wait 10 years,” says Raphael Tshimanga, a professor of hydrology and water at the University of Kinshasa, and co-chair of CBSI. “It needs to start happening now. How does this happen? By mobilising human resources and attracting funding. We don’t just want nice speeches at summits.”\nPart of the reason for the lack of resources lies in an enduring perception of the region as Joseph Conrad’s “‘heart of darkness’”, says White. “Central Africa has this reputation as a place of corruption and instability.”\nCorruption is a significant concern in the region, particularly in the Democratic Republic of the Congo (DRC) – however, it can also be wielded as an easy excuse for lack of investment.\nThe Republic of Congo’s environment minister, Arlette Soudan-Nonault, describes that view as “the tree that hides the forest”, adding: “It’s very easy and lazy to say that Africans are corrupt.”\nBeyond reputation, there are obstacles such as security, infrastructure and capacity. The DRC, which contains about 60% of the basin’s rainforest, has endured intermittent conflict for more than three decades.\n“It’s not just an issue of instability,” Soudan-Nonault says. “We need to look at ways of creating sustainable economic growth.”\nWhile the Congo basin is often seen as humanity’s last line of defence against human-made climate breakdown, deforestation in the region has begun to rise. “It is the last frontier of climate change,” the minister says. “Supporting the Congo basin is not charity. It’s about recognising its role in protecting the Earth through its carbon sink.\n“The people of the Congo basin have tightened their belts so that the world can breathe – and we receive no compensation.”\nFind more age of extinction coverage here, and follow the biodiversity reporters Phoebe Weston and Patrick Greenfield in the Guardian app for more nature coverage\nThis article was amended on 18 November 2025 to add that Richard Sufo Kankeu is a scientist at the Centre for International Forestry Research and World Agroforestry and to remove an incorrect reference to him being a lecturer at Le Mans University. Also, an earlier version said Raphael Tshimanga was a member of the Congo Basin Science Initiative; in fact, he is co-chair of the network.",
  "summary": null,
  "authors": [
    "Tam Patachako",
    "www.theguardian.com",
    "tam-patachako"
  ],
  "url": "https://www.theguardian.com/environment/2025/nov/18/congo-basin-rainforest-africa-research-funding-aoe",
  "date_publish": "2025-11-18 11:00:50",
  "source_domain": "www.theguardian.com"
}