{
  "title": "Hotel adverts banned by watchdog over misleadingly cheap rooms",
  "maintext": "Hotel adverts banned over misleadingly cheap rooms\n9 hours ago\nArchie MitchellBusiness reporter\nAdverts by four of Britain's biggest hotel and travel firms have been banned for stating misleading minimum prices for rooms.\nThe Advertising Standards Authority (ASA) upheld complaints against the Hilton hotel group, Travelodge, Booking.com and Accor over their use of eye-catching so-called \"from\" prices.\nThe watchdog found only a small number of rooms actually available to book at the promoted price and concluded the adverts overstated the deals.\nIt said this was unfair on those looking for good deals or seeking to make informed choices about where to book.\nASA operations manager Emily Henwood said: \"Advertised prices must match what's really available. If only a few rooms are actually offered at the price shown, or it only applies to a specific date, then this information must be made clear to avoid misleading people.\n\"People should be able to trust the prices they see in ads and these rulings show that we will take action if the rules are broken.\"\nThe ASA used AI to identify the misleading adverts as part of a wider probe into the availability of advertised hotel prices.\nThe Hilton hotel group was rebuked over two adverts, one reading \"Hampton by Hilton Hamilton Park From £68\", and the other advertising stays in Newcastle from £59.\nThe ASA asked Hilton whether it could back up the claims, with the hotel offering evidence that rooms were bookable at the hotels on the respective dates the adverts were viewed.\nBut the ASA concluded Hilton had exaggerated the availability of the advertised rooms, leaving potential customers at risk of being misled. It ordered the chain not to publish the adverts again and warned Hilton to ensure any future price claims reflect deals available for \"a significant proportion of rooms\".\nTravelodge had two adverts banned - one offering rooms in Nottingham Riverside \"from £25\" and the other rooms in Swansea \"from £21\".\nThe ASA found that the advertised prices were only available for a single night's stay, warning Travelodge in future to ensure deals are available \"across a range of dates\".\nA Travelodge spokesperson said it recognised the need for clarity and transparency in pricing and is working with Google to ensure its adverts are clear and comply with the ASA's guidelines. It said the relevant advert was removed before the ASA's ruling.\nSimilar findings were issued against Booking.com and hotel group Accor, while staycation chain Butlins was criticised for changing the deadline of a sale it promoted via email.\nAccor told the ASA it believed its adverts were accurate as rooms were available at or below the headline prices in the days following their publication.\nBooking.com sent the watchdog a screenshot demonstrating that seven bookings had been made at the prices it advertised.\nA spokesperson told the BBC that Booking.com accurately displays price and availability at the time advertisements are shown and will work with the ASA \"to address any outstanding questions they might have\".\nThe ASA also found Butlin's had breached its code by writing to customers that \"The big Butlin's sale ends in four days\" and \"Time is running out\".\nThe deadline to participate in the sale was eventually extended by two weeks, which the watchdog said was unfair on those who had been put under pressure to book a break before the initial deadline.\nIt urged the firm to ensure future promotions are fair to consumers. Butlins said no customers were disadvantaged by the extension of the sale window.\nThe ASA's findings come after the Competition and Markets Authority on Tuesday launched a probe into eight companies over potentially misleading online price claims.",
  "summary": null,
  "authors": [
    "Archie Mitchell"
  ],
  "url": "https://www.bbc.com/news/articles/cvgw7grp5vxo?at_medium=RSS&at_campaign=rss",
  "date_publish": "2025-11-19 00:03:52",
  "source_domain": "www.bbc.com"
}