{
  "title": "UK lacks plan to defend itself from invasion, MPs warn",
  "maintext": "The UK lacks a plan to defend itself and overseas territories from a military attack, a report by MPs has found.\nIn a highly critical assessment, the defence committee said the UK is \"nowhere near\" where it needs to be to defend itself and allies, especially at a time when security threats to Europe are \"significant\".\nThe report found that the UK is failing to meet its Nato obligations, and falling \"far short of its claimed leadership position\".\nThe report was published as the Ministry of Defence (MoD) identified prospective locations for six new munitions factories, part of a strategy to ramp up domestic defence production.\nIn June, Defence Secretary John Healey announced plans to move the UK to \"war-fighting readiness,\" including £1.5bn to support the construction of new munitions factories, which will be built by private contractors.\nBut after an 11-month inquiry, the defence committee warned the UK and its European Nato allies remained too reliant on the US and is not spending enough on its own defences.\nCommittee chair Tanmanjeet Singh Dhesi said: \"Putin's brutal invasion of Ukraine, unrelenting disinformation campaigns, and repeated incursions into European airspace mean that we cannot afford to bury our heads in the sand.\"\nHe said the committee had \"repeatedly heard concerns about the UK's ability to defend itself from attack\".\nThe specific recommendations of the committee's report included a call for the government to accelerate the speed of industrial change, and make \"readiness\" a key objective.\nEurope's heavy reliance on the US in critical areas such as \"intel, satellites, transportation of troops and air-to-air refuelling\" was also subject to critique in the report.\nIt noted that the UK had \"next to nothing\" when it came to integrated air and missile defences, and pointed to recent drones encroaching on airspace across Europe as a way new technologies can threaten civilian populations in addition to military targets.\nThe report was also particularly critical of what it calls the \"glacial pace\" of promised improvements to civil defence and resilience, saying the UK may be failing to meet its Nato Article 3 obligations to \"maintain and develop individual and collective capacity to resist armed attack\".\nDhesi says the government also needed to deliver on its promise to better communicate with the public about \"the level of threat we face and what to expect in the event of conflict\".\n\"Wars aren't won just by generals, but by the whole of the population getting behind the Armed Forces and playing our part,\" he added.\nThe government announced earlier this year that UK defence spending would rise to 3% of GDP by 2034 at the latest.\nIn a speech on Wednesday, Healey is expected to announce plans to restart the production of energetics - explosives, pyrotechnics and propellants - in the UK, after two decades of sourcing these materials from overseas.\nThe MoD is scoping out 13 sites where it believes the new factories could be built and has named the areas of the UK where they are located.\nThere are three potential sites in Scotland - in Dumfriesshire, Ayrshire and at Grangemouth, in Stirlingshire.\nIn England, a total of eight sites have been earmarked - in Teesside, Cumbria, Shropshire, Cheshire, Derbyshire, Essex, Worcestershire and Hampshire - and there are two in Wales - in Monmouthshire and Milford Haven, in Pembrokeshire.\nThe government wants at least six new factories to be operational by the next election in 2029, and hopes work will begin on the first of these next year.\nHealey is also expected to announce the opening of two new drone factories this week in Plymouth and Swindon.\n\"We are making defence an engine for growth, unambiguously backing British jobs and British skills as we make the UK better ready to fight and better able to deter future conflicts,\" the defence secretary will say.\n\"This is the path that delivers national and economic security.\"",
  "summary": null,
  "authors": [
    "Brian Wheeler"
  ],
  "url": "https://www.bbc.com/news/articles/cqjw5g24rlyo?at_medium=RSS&at_campaign=rss",
  "date_publish": "2025-11-19 02:41:24",
  "source_domain": "www.bbc.com"
}