{
  "title": "'I was bullied into false murder confession'",
  "maintext": "Police bullied me into admitting murder, says man wrongly jailed for 38 years\n4 hours ago\nPhil McCann and\nJonny Humphries,North West\nThe victim of a 38-year miscarriage of justice has claimed he was beaten by police officers and \"bullied\" into falsely admitting murder, in his first interview since his release.\nPeter Sullivan told the BBC he believes he was \"stitched up\" in 1986 over the killing of Diane Sindall, who was ambushed and beaten to death during a frenzied sexual attack in Birkenhead, Wirral.\nMr Sullivan, who has learning difficulties, had his conviction quashed by the Court of Appeal in May after new DNA tests were carried out.\nHe now wants an apology from Merseyside Police. The force said while it \"regretted\" that a \"grave miscarriage of justice\" had taken place, it maintained its officers acted within the law at the time.\nSpeaking from an undisclosed location with his face hidden to protect his privacy, Mr Sullivan, 68, said he wanted an explanation for why detectives \"picked me out\".\n\"I can't forgive them for what they've done to me, because it's going to be there for the rest of my life,\" he said, adding he had \"lost everything\" since going to prison.\n\"I've got to carry that burden until I can get an apology.\"\nFor decades Mr Sullivan and his family were haunted by tabloid press nicknames, including \"The Beast of Birkenhead\", \"The Mersey Ripper\", and \"The Wolfman\".\n\"The names, they'll always stick with me because I've never been anything like that,\" he said.\nMr Sullivan said despite moments of near hopelessness, he was always supported by his parents who died years before he could clear his name.\nHe said: \"My mum turned around to me before she died, and said, 'I want you to carry on fighting this case because you've done nothing wrong'.\"\nIn one of many painful moments from his time behind bars, Mr Sullivan said he was denied permission to attend his mother's funeral in 2013 because she was buried in the same cemetery as Miss Sindall.\nHis ordeal began after the semi-naked body of 21-year-old florist Miss Sindall was found with catastrophic injuries in an alley off Borough Road, Birkenhead, on 2 August 1986.\nTwo weeks later, her partially burned clothing was found on Bidston Hill, a large area of woodland about an hour's walk from the alley.\nAfter a BBC Crimewatch appeal was aired, witnesses came forward claiming to have seen Mr Sullivan in a pub near the murder scene that night, while others reported seeing a man fitting his description near Bidston Hill the following day.\nHe was arrested on suspicion of murder on 23 September 1986, and was interviewed 22 times over the following four weeks.\nFor the first seven police interviews, he was denied legal advice and found the experience \"very daunting\".\n\"They were putting stuff into my mind, then they would send me back to my cell, then I'd come back and say what they wanted, not realising what I was doing at the time,\" he said.\n'They leathered me'\nDuring that period Mr Sullivan claimed he was beaten in his cell on two occasions by police officers.\n\"They threw a blanket over the top of me and they were hitting me on top of the blanket with the truncheons to try and get me to co-operate with them,\" he said.\n\"It really hurt, they were leathering me.\"\nMr Sullivan also claimed he was told if he did not confess he would be charged with \"35 other rapes\", and said he was denied food and sleep.\nHe was not provided with an appropriate adult to help him understand the interrogation, despite police custody records noting he had learning difficulties.\nAsked why he would confess to a murder he did not commit, Mr Sullivan said: \"All I can say, it was the bullying that forced me to throw my hands in, because I couldn't take it anymore.\"\nAppeal court documents confirm that the first time he \"confessed\" was not recorded and no solicitor was present. Other police interviews were recorded.\nIn a statement for this article, Merseyside Police said it was previously unaware of the allegations about beatings or threats to charge him with other offences, and said records from the time did not contain details of this. It said guidance on appropriate adults had been strengthened since 1986.\nThe force accepted that legal advice was initially refused for interviews, adding that officers had feared revealing some parts of the investigation to a solicitor, in case evidence was destroyed. It also said Mr Sullivan was told he did not have to speak to officers unless he wished to do so.\nSarah Myatt, Mr Sullivan's solicitor of more than 20 years, sat alongside him as he spoke to the BBC. \"I think, from what he's told me, he just reached breaking point with it,\" she said.\nMr Sullivan said during one interview he was asked to mark on a map where he had left the clothes on Bidston Hill. When he pointed to the wrong place, he alleges a detective replied: \"Come on Peter, you know better than that,\" before hinting at the \"correct\" location.\nMs Myatt said on the maps of Bidston Hill, Mr Sullivan had later written \"this is all lies\".\n\"I think that's quite poignant,\" she said.\nMerseyside Police said the maps and transcripts, which the BBC has not seen, were all served on the courts. The force said interviewing officers had been \"trying to understand the validity of his admissions\".\nWhile Mr Sullivan later retracted his confessions, the police and prosecution also relied on bite mark evidence, a now widely discredited field of forensic science.\nThat case, brought before DNA testing was widely available, was enough to convince a jury at Liverpool Crown Court - and on 5 November 1987 he went from a self-confessed \"petty thief\" to a convicted murderer.\nRecalling the guilty verdicts, Mr Sullivan said: \"My sister collapsed in the courtroom and the next minute, that was it.\n\"I was taken down from the courtroom and I just sat in that cell and cried my eyes out over the crime I hadn't done.\n\"I knew from then on that this is going to be one hell of a case to try and fight to try and get myself out of this situation.\"\nHis sentence carried a minimum term of 16 years before he was eligible to apply for parole - but Mr Sullivan maintained his innocence, lessening his chances of release.\nPrison was particularly difficult for someone considered a savage killer and a sex offender. \"I've been battered in prisons because of the crime I was in for,\" he said.\nHowever, he said reporting such violence was not an option because \"then you're a grass, and that means then you're going to get a lot worse\".\n'You're going home'\nThe end of his nightmare began in 2023, when the Criminal Cases Review Commission - the body set up to check for miscarriages of justice - ordered fresh testing of semen samples found on Miss Sindall's body in 1986.\nThe Crown Prosecution Service (CPS) decided not to challenge the DNA results ahead of a fresh appeal - paving the way for Mr Sullivan's freedom.\nIn May 2025, when the appeal judgement was handed down, Mr Sullivan was listening via video-link from HMP Wakefield, sitting next to his probation officer.\n\"When they came back in with the verdict that my case had been quashed, [the probation officer] burst into tears first,\" he said.\n\"She turned around and said, 'Peter, you're going home'...\n\"Next minute, bang, all the tears started running down my face and that was it, I went, 'yes, justice has been done'.\"\nThe outside world has been a baffling place for a man who went into custody when Margaret Thatcher was prime minister and the internet was unheard of.\nSpeaking of the moment he was driven out of prison, he said: \"I was watching the cars go by, and I've never seen so many different cars in my life on that road.\n\"It was daunting just seeing them all changed and everything.\"\nSince his release, he has sometimes found himself standing in his bedroom waiting for a prison officer to do a roll-call - a difficult habit to shake after nearly 40 years.\nMr Sullivan said he feels \"really sorry\" for the family of Miss Sindall, who he said are \"back at square one\" in their fight for justice.\n\"I've been through the same pain, being in prison, because I've been taken away from my family as well for something I haven't done,\" he said.\nMerseyside Police said due to the \"substantial changes\" in the law and investigative practices since 1986, there would be \"little benefit\" in any formal review of how the case was investigated.\nIt said it referred itself the Independent Office for Police Conduct after the appeal judgement but no misconduct was identified.\nThe Crown Prosecution Service said while the Court of Appeal accepted the new DNA testing, other grounds of appeal were rejected. Nick Price, its director of legal services, said: \"The prosecution case was brought on the basis of all the evidence available to us at the time.\"\nThe case of Miss Sindall's murder has been re-opened, although no arrests have been made.\nFor Mr Sullivan, there remains the wait for compensation, capped by the government at £1.3m for wrongful convictions.\nMs Myatt, who is helping him with his application, said: \"There's not a figure that you could say would be enough for losing 38 years of your life.\"",
  "summary": null,
  "authors": [
    "Phil McCann"
  ],
  "url": "https://www.bbc.com/news/articles/cd04x43vg1ko?at_medium=RSS&at_campaign=rss",
  "date_publish": "2025-11-19 06:21:36",
  "source_domain": "www.bbc.com"
}