{
  "title": "Nicki Minaj to spotlight plight of Nigerian Christians in UN speech arranged by White House",
  "maintext": "The US-based Trinidadian rapper Nicki Minaj will work alongside the White House to highlight claims of Christian persecution in Nigeria.\nMinaj is expected to deliver a speech at the United Nations headquarters in New York on Tuesday, according to a Time journalist who first posted about the collaboration on Sunday, adding that it was arranged by Alex Bruesewitz, an adviser to Donald Trump.\nResponding to the X post, the US ambassador to the UN, Michael Waltz confirmed the plan, describing Minaj as “not only arguably the greatest female recording artist, but also a principled individual who refuses to remain silent in the face of injustice”.\n“I’m grateful she’s leveraging her massive platform to spotlight the atrocities against Christians in Nigeria, and I look forward to standing with her as we discuss the steps the president and his administration are taking to end the persecution of our Christian brothers and sisters,” he added.\nMinaj later confirmed the collaboration, writing: “Ambassador, I am so grateful to be entrusted with an opportunity of this magnitude. I do not take it for granted. It means more than you know.”\nReferring to her fanbase, known as the Barbz, she continued: “The Barbz & I will never stand down in the face of injustice. We’ve been given our influence by God. There must be a bigger purpose.”\nMinaj’s collaboration with the White House comes just days after she publicly supported a Truth Social post from the US president in which he condemned what he called the Nigerian government’s failure to prevent attacks on Christians.\nTrump’s comments follow weeks of pressure from conservative Christian groups urging him to categorize the west African nation as a “country of particular concern” over alleged religious persecution. In his statements, Trump has not made mention of any violence against Muslims who have also been targeted by extremist religious groups, including Boko Haram.\nIn response to Trump’s comments earlier this month, Minaj wrote on X: “Reading this made me feel a deep sense of gratitude. We live in a country where we can freely worship God … Thank you to the president & his team for taking this seriously. God bless every persecuted Christian.”\nTrump has also threatened to send US troops “guns-a-blazing” to Nigeria, which he called a “disgraced country”, adding that if the US did militarily intervene, “it will be fast, vicious and sweet, just like the terrorist thugs attack our cherished Christians.”\nNigeria’s leadership has swiftly contested Trump’s comments, with its president, Bola Ahmed Tinubu, saying that Nigeria “is a democracy with constitutional guarantees of religious liberty”.\nAlthough the country is officially secular, Nigeria is closely split between Muslims (53%) and Christians (45%). Despite violence against Christians having garnered international attention, analysts say the causes are more complex, with many conflicts stemming from ethnic rivalries as well as land and water disputes, among other reasons.\nKidnappings of priests and pastors have surged, as criminals see them as high-value targets whose communities can raise ransom quickly, prompting some analysts to view their actions as driven more by criminal profit than religious discrimination.",
  "summary": null,
  "authors": [
    "Maya Yang",
    "www.theguardian.com",
    "maya-yang"
  ],
  "url": "https://www.theguardian.com/music/2025/nov/17/nicki-minaj-un-speech-trump-nigeria-christian",
  "date_publish": "2025-11-17 19:24:54",
  "source_domain": "www.theguardian.com"
}