{
  "title": "'Scotland cash in almost 30 years of glorious failure as dreams come true'",
  "maintext": "The last kick of a win that takes Scotland to their first men's World Cup in almost three decades is a Kenny McLean goal from the halfway line.\nThis is not a dream.\nThe 33-year-old Norwich midfielder is wheeling his way to the corner flag with almost every member of the squad hunting him down.\nBen Gannon-Doak, who was taken off on a stretcher in the first half of this utterly incredible 4-2 victory over Denmark, is like a Jack Russell welcoming its owner home from a week abroad.\nFireworks are igniting out of the Hampden roof as Scott McTominay lies in a heap.\nAbout two hours earlier, his outrageous overhead kick had grown adults crying, hugging and bouncing about like toddlers. And that was only in the media seats.\nGoalkeeper Craig Gordon, 43 next month, has his hands in his gloves in disbelief as the Hampden DJ hits play on Freed From Desire.\nThis is not a dream.\nBodies are still flying about Hampden like empty tracksuits. Steve Clarke is one of them.\nA generation of Scotland fans have just witnessed the greatest game of their lives. The old guard might say the same after that.\nNope, it wasn't a dream.\nThere's been a sense this night of all nights was written in the stars, given the way Scotland's bizarre qualifying campaign played out.\nLady Luck has been mentioned, but there was nothing fortunate about McTominay leaping the height of the Finnieston Crane to score an outrageous bicycle kick.\nThere was no luck in Scotland responding not once, but twice when it looked like the national team were going to find a new way to break five million hearts against the 10 men of Denmark.\nOne fan said pre-match it felt like Scotland had cashed in almost 30 years' worth of glorious failure. Another supporter said Clarke and his players must have sold their souls for this opportunity.\nIf that's what it takes to witness an occasion like this, the Tartan Army might be happy to wait another three decades for the next one.\nThe thought of Andy Robertson and John McGinn dragging their bags of Scotland misfortune up to the football gods in exchange for a World Cup appearance is quite the image. After all, there is every chance this is their last go at this.\nTwo absolute titans of this Scotland side, Robertson and McGinn, both 31, were the life and soul of the post-match celebrations.\nThe emotion bursting out of the two of them hit like Kieran Tierney's stunner. Boy do they deserve this.\nAnd that is before you even try to make sense of the emotional Hokey Cokey in the stands. Bedlam to anxiety. Anxiety to heartache. Heartache to bedlam. Bedlam to heartache. Heartache to bedlam. Bedlam to disbelief.\nPre-match, nobody in the ground could have said they weren't ready to run on that pitch and do the job themselves when one of Hampden's great renditions of Flower of Scotland followed a pyro show.\nThree minutes after the first whistle, McTominay was sprinting to the home dugout after the goal of his career.\nThere the Napoli midfielder stood, all alone, blowing a kiss up to his loved ones. The kids apparently call it 'aura'.\n\"You've just witnessed the goal of the season,\" screamed the PA announcer. A generation of Scotland fans had just witnessed the goal of their life.\nWell, they thought they had. Tierney's curler and McLean's astonishing moment will also qualify.\nWhen the party moved to elsewhere and the Hampden stands were eventually empty, there was veteran keeper Gordon, drafted back in for this camp, standing on the pitch getting pictured with his family.\nA good chunk of this squad weren't born the last time Scotland played on the grandest stage. The rest were probably still in nappies.\nGordon, a teenager at the time, will remember his dreams. Next summer, he and his team-mates get to live them with the nation.",
  "summary": null,
  "authors": [
    "Nick McPheat",
    "www.facebook.com"
  ],
  "url": "https://www.bbc.com/sport/football/articles/cew4v8vgkyyo?at_medium=RSS&at_campaign=rss",
  "date_publish": "2025-11-18 23:35:48",
  "source_domain": "www.bbc.com"
}