{
  "title": "Argentina judge fired after causing mistrial in case over Maradona’s death",
  "maintext": "An Argentinian judge has been fired after causing a mistrial in the negligence case against the late football legend Diego Maradona’s medical team due to her involvement in a documentary about it.\nA special panel of judges, lawyers and provincial legislators dismissed Julieta Makintach, 48, from her post and disqualified her from holding any other judicial position in the future.\nMakintach was one of three judges in the now-annulled trial that followed Maradona’s death in 2020 while recovering from brain surgery for a blood clot after decades battling cocaine and alcohol addictions.\nShe recused herself after it emerged she had been interviewed for a miniseries about the case, potentially breaking a string of ethics rules.\nMakintach had denied participating in, or authorizing, any filming for a documentary about the case, but footage shared in Argentinian media showed her being interviewed by a film crew.\nProsecutors also allege that the judge allowed the film crew unauthorised access to the courthouse on a Sunday, two days before the trial began.\nAccording to prosecutors, the footage was shot without the knowledge of the other judges, Maradona’s family, or the defendants.\nMaradona died on 25 November 2020, aged 60, of heart failure and acute pulmonary edema two weeks after going under the knife.\nHe was found dead in his bed by a day nurse.\nMaradona’s medical team is on trial over the conditions of his convalescence at a private home.\nProsecutors have described the football icon’s care in his last days as grossly negligent.\nThe defendants risk prison terms between eight and 25 years if convicted of “homicide with possible intent” – pursuing a course of action despite knowing it could lead to death.\nThe case so far has focused on the decision by Maradona’s doctors to allow him to recuperate at home with minimal supervision and medical equipment, instead of a medical facility.",
  "summary": null,
  "authors": [
    "Guardian staff"
  ],
  "url": "https://www.theguardian.com/world/2025/nov/18/argentina-judge-diego-maradona-case-fired",
  "date_publish": "2025-11-18 16:15:52",
  "source_domain": "www.theguardian.com"
}