{
  "title": "People seeking council help amid home repossession fears double",
  "maintext": "'I worked, I paid taxes - then the bank took my home'\n7 hours ago\nLaurence Cawley,\nPhil Shepka and\nCharlotte Rose,BBC London and East Investigations\n\"I am waiting for the bailiff to knock on the door, take my keys and kick me out,\" says Jose Da Costa Diogo, one of thousands of people who have been told this year their homes will be repossessed.\nThe 65-year-old learned he would lose his home in Thetford, Norfolk, during a brisk 10-minute county court hearing earlier this year.\nThe interest-only mortgage on the three-bedroom property was taken out more than 20 years ago in the hope he and his then wife would save up enough to eventually cover the capital sum.\nBut the collapse of the marriage and his ex-wife's departure to Brazil in 2015, left Mr Da Costa Diogo unable to repay the £80,000 still outstanding.\nAnd because his ex-wife was still on both the mortgage documents and the property deeds, he was also unable to sell the property to cover the outstanding amount.\n\"I tried to do the right thing and carried on paying all the bills,\" he said. \"After 25 years, I have nothing to show... but I still have to carry on living.\n\"I'm going to be homeless.\"\nCourt figures show the number of mortgage repossession orders in England and Wales reached 10,853 in 2024-25 - the highest number in five years.\nExperts say the rise is down to a variety of factors including interest rate increases and the rise in the general cost of living.\nMr Da Costa Diogo registered as homeless with Breckland Council, his local authority.\nHe is far from alone.\nThe BBC asked every English council with housing responsibilities how many people presented as homeless as a result of a mortgage repossession.\nThe number has doubled, according to the 240 councils that provided comparable data - from 1,517 in 2022-23, to 2,370 in 2023-24.\nIt was 3,406 in the most recent year.\nPeople in local government say rehoming those affected by repossessions is putting ever greater stress on council resources.\nTom Hunt, who chairs the Local Government Association's Inclusive Growth Board, said: \"As more and more people turn to their council for help, local authorities are having to stretch budgets further.\n\"The temporary accommodation crisis facing councils is only worsening.\"\nLucy Davies sees the devastation repossessions can have on a daily basis.\nA housing law advisor with the Suffolk Legal Centre, she volunteers her expertise to those in need at courts in Suffolk and Essex.\n\"I see the sheer number of people that this is affecting,\" said Ms Davies.\n\"People get into difficulties largely through no fault of their own.\n\"Quite often there's mental health, there's employment issues, there's family issues, and I think it can very quickly spiral out of control.\"\nOn the day the BBC joined Ms Davies for a day at Ipswich County Court, where she volunteers with the Ipswich County Court Advice and Representation Service, none of the five people facing mortgage repossession cases turned up.\nThis, she said, was often a symptom of shame, despair and the sense that losing one's home is a foregone conclusion.\n\"It is quite frightening coming to court, but it doesn't have to be.\"\nShe urged people to seek advice as soon as possible and said the cases she was seeing were becoming \"more entrenched or more serious\".\nPeople were finding it increasingly difficult to access housing legal aid, she explained.\nPaul Gorton, of The Law Society's housing law committee, agreed.\nHe said a historic lack of investment in legal aid meant fewer and fewer law firms were able to offer legal aid housing advice.\n\"Many people are too well off to be eligible for legal aid but cannot afford to pay for legal advice themselves,\" Mr Gorton said.\n\"We have both legal aid provider deserts and restrictive eligibility criteria leaving many people stuck in limbo.\"\nA Ministry of Justice spokesperson said it had recently announced \"the first major funding increase for housing legal aid in three decades - a 24% rise\".\n\"This investment will help ensure effective access to justice for some of the most vulnerable in our society, while supporting a more stable and sustainable legal aid sector,\" the spokesperson said.\nSeeking to repossess a home is \"always a last resort\" for lenders, said Karina Hutchins, a principal in the mortgage policy team at UK Finance, a trade association for the banking and financial services sector.\nShe said while the number of mortgage repossessions had been creeping up in recent years, the current levels remained \"historically low\".\n\"Repossessions are really, really uncommon.\"\nShe said in the first quarter of 2025, about 2,000 homes were repossessed compared with 13,000 in the same quarter of 2009, in the wake of the 2008 financial crash.\n\"I can imagine that customers are really worried and distressed if they're facing financial difficulty, but they don't have to go through it alone,\" Ms Hutchins said.\n\"The earlier they get in touch with their mortgage lender, the more support and help that that lender can give them and the more likelihood they have of getting back up to date with their mortgage.\"\nOptions offered by lenders, she said, included reduced mortgage payments to allow time to get back on track, budgeting and other tools to understand \"their full financial situation\" and advice about debt charities and support organisations.\nHenry Sabati McRae, who lives in Croydon, south London, has so far managed to stave off repossession.\nA software developer by training, Mr McRae's financial woes came in the wake of the death of a brother in 2020 and his mother in October 2023.\nSince October 2024, the 51-year-old has been out of work and, despite applying for hundreds of jobs, he has not managed to get a new contract.\n\"It doesn't matter how much you have in savings,\" he said.\n\"Within a few months it is wiped out. I managed to stretch it as far as I could, because I'd been quite conservative with how I was doing.\"\nIf you have been affected by this story or would like support then you can find organisations which offer help and information at the BBC Action Line.\nEven so, the mortgage arrears on his two-bedroom flat eventually grew to about £13,000 and his bank said if that figure was not reduced to below £8,000 it would seek to repossess his home.\n\"The most important thing for me at that time, and I think for anybody, was keeping the roof over my head,\" he said. \"Otherwise it spirals out of control.\"\nTo scrape by, he has turned to selling off his possessions on an internet auction site and accepting a loan from a friend.\nLike many of those facing repossession action the BBC has spoken to, Mr McRae said the experience was deeply \"humiliating\" and that his instincts were initially \"to draw the curtains shut\".\nHowever, he said realising he was far from alone and in speaking about it has helped him plot out, like an IT problem, his \"solution to it\".\nBusinessman Mike Williams, who lives 10 miles (16km) south of Mr McRae in Caterham, Surrey, has also avoided repossession.\nHe took on the mortgage of his self-build home after he and his wife separated.\nIn three years, repayments on the interest-only loan, which was taken out 20 years ago, have tripled.\nHe says it has left him with \"next to no disposable income\".\nAt court, he renegotiated a repayment plan which would add an extra 20% to his monthly payments.\nIn five years, when the mortgage comes to term, he intends to sell the two-bedroom house which he and his wife built from the ground up.\n\"It has quite a bit of sentimental value to me, so yes it is heart-wrenching,\" he said.\nAs for Mr Da Costa Diogo, his bank has repossessed the property.\nIn the same month it was repossessed, the BBC saw a similar three-bedroom property in the same Thetford street as Mr Da Costa Diogo's on the market for £160,000 - almost double the amount he owed.\nWithin hours of losing his home, he was given emergency accommodation in a small ground-floor studio in north Suffolk.\n\"I left my house with one suitcase and a bag of essentials and told the council 'I'm homeless'.\n\"It's a roof over my head. I'm trying to keep things simple because what is the point of complicating things?\n\"I'm alive and I carry on.\"",
  "summary": null,
  "authors": [
    "Laurence Cawley"
  ],
  "url": "https://www.bbc.com/news/articles/cp8jz321x14o?at_medium=RSS&at_campaign=rss",
  "date_publish": "2025-11-19 03:39:23",
  "source_domain": "www.bbc.com"
}