{
  "title": "New drug could be a breakthrough in treatment for killer TB, trial suggests",
  "maintext": "A new treatment for tuberculosis could boost cure rates and shorten the time needed to treat the disease by months, trial results suggest.\nGlobally, an estimated 10.7 million people fell ill with TB last year and 1.23 million died from it.\nIn its annual report on tuberculosis, launched last week, the World Health Organization said it remained a “major global public-health problem” and the leading infectious cause of death.\nProgress is being threatened by aid cuts and already falling short of targets towards a UN goal of ending TB as a public-health threat this decade, the WHO said.\nSorfequiline, a new antibiotic, showed stronger action against the deadly bacteria than existing treatments, with a comparable safety profile, researchers from the TB Alliance told the Union Conference on Lung Health in Copenhagen on Wednesday.\nThe trial involved 309 people across 22 sites in South Africa, the Philippines, Georgia, Tanzania and Uganda, with different dose regimens.\nAll participants had “drug-sensitive” tuberculosis, meaning a standard cocktail of drugs can safely treat them but researchers believe TB infections that are resistant to standard treatment could also be helped.\nThe trial suggested a sorfequiline-based regimen could be used for anyone testing positive, said Dr Maria Beumont, vice-president of TB Alliance.\nShe said: “I can just put you on a treatment while I’m waiting to understand exactly what your situation is. I don’t need to wait to get information back and classify you as drug sensitive, this or that regimen. There is no need to go through all of that.”\nAccess to swift diagnostic tests for TB is patchy and it can take days or weeks in some places for doctors to get laboratories to identify the TB type a patient has before they can be helped.\nDr William Brumskine, clinical research site leader at the Aurum Institute in Rustenburg, South Africa, said he hoped overall care would be improved. “The hope of having a universal regimen that is shorter, that has less side-effects, is you will have less individuals coming in for clinic visits [and so] the health care providers will have more time to give individual care to patients,” he said.\nA decade ago, patients with drug-resistant tuberculosis faced a gruelling treatment regimen of 18 months or more, involving multiple injections and hospital stays, that only cured about 50% of people. The current gold-standard treatment, introduced in 2019, successfully treats 90% of people within six months. Researchers hope using sorfequiline could improve things further.\nBeaumont said excitement had built before the full trial results arrived. “It’s incredible when you start getting these little anecdotes from the sites [such as]: ‘This patient got cured so fast. I don’t know what arm [of the trial] he was on, but wow, I’ve never seen this before.’”\nTB Alliance said it hoped to launch a phase-3 clinical trial in 2026.\nDr Kavindhran Velen, chief scientific officer at the International Union against Tuberculosis and Lung Disease, which organised the conference, said a swifter, more effective TB treatment could have clear benefits, increasing the proportion of patients completing treatment and reducing the time they are contagious.\nHowever, he said he worried that applying it universally to TB patients could have downsides, including disincentivising health systems’ investment in wider innovations such as laboratories and testing.\nHe said doctors would need to be sure any universal TB treatment was not akin to “taking a hammer to an ant [for patients who could be treated with gentler drugs]. We don’t want to overexpose an individual to treatment that is not necessarily needed.”",
  "summary": null,
  "authors": [
    "Kat Lay",
    "www.theguardian.com",
    "kat-lay"
  ],
  "url": "https://www.theguardian.com/global-development/2025/nov/19/new-drug-could-be-breakthrough-killer-tb-tuberculosis-sorfequiline",
  "date_publish": "2025-11-19 10:00:12",
  "source_domain": "www.theguardian.com"
}