{
  "title": "Was McTominay overhead kick Scotland's third best goal of night?",
  "maintext": "\"Scott McTominay scored the best overhead kick I've ever seen and it might not have been the best goal of the night.\"\nThe words of Scotland head coach Steve Clarke, talking about what might quite literally be the high point of the Napoli midfielder's career.\nJust three minutes into the decisive World Cup qualifier against Denmark, McTominay leapt and with him, almost lifted Hampden from its very soil in the south side of Glasgow. But there was more to come.\nNo Scotland fan would have believed that further incredible goals would come over the next 95 minutes. Yet with so much on the line, this team scored three of the best goals in their 153-year footballing history.\nArchie Gemmill against the Netherlands in 1978, James McFadden against France in 2007, and Shaun Maloney against Ireland seven years later all now have serious competition.\nIt's hard to pick a favourite, so let us take you through them. We'll start with McTominay's balletic flight.\nNot even 180 seconds on the clock, and he connected with a ball seven, eight, or nine feet in the air - depending on who you ask - to scissor kick Scotland into the lead.\nThis was after Ben Gannon-Doak had chopped inside and floated in an inviting ball, but only a Ballon d'Or nominee might have the confidence to attempt something so audacious.\n\"Cometh the hour, cometh the man!,\" screamed former Scotland midfielder Michael Stewart on Sportsound. \"That is outrageous! I genuinely don't think I've ever seen a better goal.\"\n\"The man for the big occasion,\" added former Scotland talisman McFadden. \"It's spectacular.\"\n\"You have to go back to Archie Gemmill with his goal [to think of better],\" said former national team striker Billy Dodds at half-time.\nEven Scottish sporting legend Andy Murray was impressed...\nNo offence to Lawrence Shankland, but we'll quickly brush his goal aside. From a yard out he stabbed Lewis Ferguson's corner over the line to put Scotland's fans back in dreamland, albeit briefly.\nDenmark equalised quickly and there wes a gut-wrenching wait until Kieran Tierney struck another absolute beauty.\nThe game was into the second minute of added-on time - and Scotland seemed set to be condemned to the torment of the play-offs - when the ball fell to the makeshift right-back, who curled a beauty past Celtic colleague Kasper Schmeichel.\nA goal from the heavens, from a man who has been through so much since the summer of 2024 when his Euro campaign was cut short by a hamstring injury.\n\"It couldn't have happened to a more favourable player going through such hard times,\" Stewart said. \"That is just pure class.\"\nAnd head coach Clarke was pretty happy with the identity of the man who scored the goal that took Scotland to the top of the mountain.\n\"I spoke to Kieran before the first game,\" said Clarke. \"He's a key player for me, one of my men.\n\"I said 'listen, Aaron Hickey can't do back-to-back games, I can see you coming on at right-back and doing very well for us'.\n\"I'm not sure I envisioned the goal - but when it was rolling back to him on his left foot, I knew he would score.\"\nJust when it seemed it couldn't get any better...\nThe ball broke to Kenny McLean - occasionally maligned but one of Clarke's most-trusted lieutenants - with the Danes already on the canvas.\nHe shimmied away from the only remaining defender, spotted Schmeichel off his line, and chipped him from the halfway line with a shot that defied belief and perhaps gravity itself.\n\"When [Kenny] hit it, I thought 'what are you doing?!' but when I saw it in flight, I thought 'that's going to go in!',\" Clarke said.\nIt might be better summed up by Steven Thompson, the former Scotland striker on co-comms speaking for the nation. \"Shoot! Shoot!\" he screamed.\n\"He's done him! He's done him!\" when the ball was in flight.\nWhen it hit the back of the net, there were no words, just bedlam.\nPick your favourite. We can argue about it in North America...",
  "summary": null,
  "authors": [
    "Andrew Petrie",
    "www.facebook.com"
  ],
  "url": "https://www.bbc.com/sport/football/articles/ckg15p9rlnxo?at_medium=RSS&at_campaign=rss",
  "date_publish": "2025-11-19 02:31:08",
  "source_domain": "www.bbc.com"
}