{
  "title": "Sister's 'jealous' ex lit fatal Bradford house fire, jury told",
  "maintext": "Sister's 'jealous' ex lit fatal fire, trial told\n17 hours ago\nEmma GlasbeyYorkshire home and social affairs correspondent\nA mum and her three children were murdered in a fire after her sister's \"jealous\" ex-partner broke into their home and set it alight, a trial has heard.\nBryonie Gawith, 29, and her children, Denisty, nine, Oscar, five, and 22-month-old Aubree Birtle, all died in the fire on Westbury Road in Bradford in August last year.\nA jury at Doncaster Crown Court heard that Sharaz Ali, 40, was the \"main mover\" who had decided to \"take revenge\" on Antonia Gawith - his ex-partner and Bryonie's sister - who was the only one to escape.\nMr Ali, of Bradford, and Calum Sunderland, 26, of Keighley, deny four counts of murder, the attempted murder of Antonia Gawith and attempting to cause her grievous bodily harm.\nOn the opening day of the trial on Tuesday, prosecutor David Brooke KC told the court that Mr Ali was \"motivated by jealousy and fuelled by drink and drugs\" and had \"decided to take revenge on his ex-partner Antonia regardless of the potential consequences for others\".\nMr Brooke told jurors that Mr Ali, of no fixed address, poured petrol in the house and set light to it just after 02:00 BST on 21 August.\nBryonie Gawith and her three children died in the \"catastrophic\" fire, while Antonia was unable to get back into the house after escaping the blaze, the prosecutor told the jury.\nThe prosecutor told the court that Mr Ali was \"caught by his own actions\" and was later pulled injured from the house by police officers.\nHe was placed in an induced coma for several months before his condition improved, the court was told.\nA third man, 45-year-old Mohammed Amjid Shabir, had driven Mr Ali and Mr Sunderland to the scene and would have been on trial with the other two men, the jury was told, but had since died from natural causes.\n'Exploded into life'\nMr Brooke said Antonia had been in a relationship with Mr Ali for seven years, describing it as \"an abusive relationship exacerbated by his drinking\".\nShe decided to separate from him in August and stayed with her sister, the jury was told.\nDoorbell footage from the night of the fire displayed Mr Sunderland, of Calton Street, carrying a canister containing seven litres of petrol.\nMr Sunderland was heard being ordered by Mr Ali to \"kick the door in\", with Mr Sunderland then running back to the car.\nThe footage captured the moment the fire started and an explosion at the house.\nThe jury was told that Antonia had gone downstairs at the property when she heard noises at the front door and Mr Ali subsequently poured petrol on her.\nThe court heard that she tried to get the petrol and a lighter from him, before running outside shouting for help in the hope that he would follow.\nThe prosecution said Antonia ran back to the house and saw her sister on the stairs kicking Mr Ali before a fire engulfed \"himself, the stairs and her sister\".\nThe fire \"exploded into life\", the court heard, with screaming heard on the doorbell footage.\nBryonie and her three children were brought out of the house by firefighters and police, the jury was told, but it was too late to save them despite their efforts.\nIn a written statement to police, Mr Sunderland had denied knowing what Mr Ali was going to do and said his co-defendant was drunk, not making sense and described him as \"a bully\".\nThe trial continues.",
  "summary": null,
  "authors": [
    "Emma Glasbey"
  ],
  "url": "https://www.bbc.com/news/articles/c1m3dpdpvpjo?at_medium=RSS&at_campaign=rss",
  "date_publish": "2025-11-18 14:18:54",
  "source_domain": "www.bbc.com"
}