{
  "title": "'Things happen' - Trump defends Saudi crown prince over Khashoggi killing",
  "maintext": "US President Donald Trump said Saudi Crown Prince Mohammed bin Salman \"knew nothing\" about the 2018 killing of journalist Jamal Khashoggi, as he welcomed the kingdom's de facto ruler to the White House.\nTrump's comments appeared to contradict a US intelligence assessment in 2021 which determined the crown prince had approved the operation that led to Khashoggi's death at the Saudi consulate in Istanbul in 2018.\nThe crown prince, who has denied any wrongdoing, said at the White House that Saudi Arabia \"did all the right things\" to investigate Khashoggi's death, which he called \"painful\".\nIt was his first US visit since the assassination, which sent shockwaves through the US-Saudi relationship.\nIn the Oval Office on Tuesday, Trump shot back at a reporter who asked a question about the killing.\n\"You're mentioning someone that was extremely controversial,\" the US president said.\n\"A lot of people didn't like that gentleman that you're talking about. Whether you like him or didn't like him, things happen.\"\n\"But he [the Crown Prince] knew nothing about it,\" Trump added. \"You don't have to embarrass our guests.\"\nThe crown prince added that Saudi Arabia \"did all the right steps\" to investigate the murder, which he called \"painful\" and a \"huge mistake\".\nA US intelligence report made public in 2021 - under President Joe Biden's administration - determined that the crown prince had approved of a plan to \"capture or kill\" Khashoggi in Istanbul. During his first administration, Trump White House officials declined to release the report.\nWhile dozens of Saudi officials faced sanctions in the wake of the assassination, none directly targeted the crown prince.\nReacting to Trump's comments, Khashoggi's widow, Hanan, told BBC Newsnight the US president's defence of the crown prince did not match up with bin Salman's own acknowledgment of responsibility for her husband's murder.\n\"The crown prince himself, in 2019 and 60 Minutes interview, he did take accountability about and hold responsibility about this horrible crime,\" she said.\nIn a post on X, she also called for a meeting with the crown prince and an apology along with compensation for her husband's murder.\nGranted political asylum in the US, she lives in the Washington DC area.\nTuesday's meeting between Trump and Mohammed bin Salman was expected to include deals on civilian nuclear power, artificial intelligence and Saudi investment in the US, which the crown prince said was being upped to $1tr (£761bn) from $600bn pledged earlier this year.\nEchoing Trump's own words, bin Salman said that the US was the \"hottest country on the planet\" and praised the US president for creating \"long-term opportunity\".\nThe two men also discussed the potential sale of advanced F-35 fighter aircraft to the Saudis.\nTrump said that while export licences were still being announced, he expected a deal between the Saudis and US defence giant Lockheed Martin.\nThe potential sale has caused alarm among some Israeli officials, who have said that it could potentially hurt the country's \"qualitative military edge\" in the Middle East, where it is so far the only nation to have F-35s.\nThe US president said the model sold to the Saudis would be broadly similar to the one the Israelis operate.\n\"This [Saudi Arabia] is a great ally, and Israel is a great ally,\" Trump said. \"I know they'd like you to get planes of reduced calibre.\n\"But as far as I'm concerned, I think they are both at a level where they should get top of the line,\" he added.\nThe crown prince's visit to Washington continues with a gala dinner on Tuesday night, followed by an investment summit on Wednesday.\nPortuguese footballer Cristiano Ronaldo - who plays in the Saudi professional league - was also present at the dinner.\nBiden did not host the crown prince and vowed to make Saudi Arabia a \"pariah\" over its human rights record. In 2022, however, Biden visited the kingdom to reach agreement on other issues.",
  "summary": null,
  "authors": [
    "Bernd Debusmann Jr"
  ],
  "url": "https://www.bbc.com/news/articles/cn0gdkwp2p9o?at_medium=RSS&at_campaign=rss",
  "date_publish": "2025-11-18 20:21:47",
  "source_domain": "www.bbc.com"
}