{
  "title": "First kiss dates back 21 million years, say scientists",
  "maintext": "10 hours ago\nVictoria GillScience correspondent, BBC News\nHumans do it, monkeys do it, even polar bears do it. And now researchers have reconstructed the evolutionary origins of kissing.\nTheir study suggests that the mouth-on-mouth kiss evolved more than 21 million years ago, and was something that the common ancestor of humans and other great apes probably indulged in.\nThe same research concluded that Neanderthals may have kissed too – and that humans and Neanderthals may even have smooched one another.\nThe scientists studied kissing because it presents something of an evolutionary puzzle - it has no obvious survival or reproductive benefits, and yet it is something that is seen not just in many human societies, but across the animal kingdom.\nBy finding evidence of other animals engaging in kissing, scientists were able to construct an \"evolutionary family tree\" to work out when it was most likely to have evolved.\nTo ensure that they were comparing the same behaviour across different species, the researchers had to give a very precise - rather unromantic - definition to a \"kiss\".\nIn their study, published in the journal Evolution and Human Behaviour, they defined kissing as non aggressive, directed oral-oral contact \"with some movement of lips or mouthparts and no food transfer\".\n\"Humans, chimps, and bonobos all kiss,\" explained lead researcher Dr Matilda Brindle, an evolutionary biologist from the University of Oxford. From that, she concluded, \"it's likely that their most recent common ancestor kissed.\"\n\"We think kissing probably evolved around 21.5 million years ago in the large apes.\"\nIn this study, scientists found behaviour that matched their scientific definition of kissing in wolves, prairie dogs, polar bears (very sloppy - lots of tongue), and even albatrosses.\nThey focused on primates - and apes in particular - in order to build an evolutionary picture of the origin of the human kiss.\nThe same study also concluded that Neanderthals - our closest ancient human relatives that died out around 40,000 years ago - also kissed.\nOne previous piece of research on Neanderthal DNA also showed that modern humans and Neanderthals shared an oral microbe - a type of bacteria found in our saliva.\n\"That means that they must have been swapping saliva for hundreds of thousands of years after the two species split,\" explained Dr Brindle.\nWhile this study pinpointed when kissing evolved it was not able to answer the question of why.\nThere are already a number of theories - that it arose from grooming behaviour in our ape ancestors or that it might provide an intimate way to assess the health and even the compatibility of a partner.\nDr Brindle hopes that this will open a door to answering that question.\n\"It's important for us to understand that this is something we share with our non-human relatives,\" she said.\n\"We should be studying this behaviour, not just dismissing it as silly because it has romantic connotations in humans.\"",
  "summary": null,
  "authors": [
    "Victoria Gill"
  ],
  "url": "https://www.bbc.com/news/articles/cr43gq61g2qo?at_medium=RSS&at_campaign=rss",
  "date_publish": "2025-11-19 00:08:59",
  "source_domain": "www.bbc.com"
}