{
  "title": "China suspends seafood imports from Japan as Taiwan row escalates",
  "maintext": "China has suspended imports of Japanese seafood again, as the fallout over the Japanese prime minister’s comments about Taiwan continues to escalate in one of worst bilateral disputes in years.\nThe ban was first reported on Wednesday by the Japanese outlets Kyodo News and NHK, and appeared to be confirmed by China’s foreign ministry, which said there was “no market for Japanese seafood in the current climate”.\nThe reports said China’s government had informed Japan it was suspending all seafood imports, months after it partly lifted a previous ban issued in 2023.\nThe original ban was imposed in response to Japan’s decision to release wastewater from the damaged and decommissioned Fukushima nuclear plant. Chinese officials reportedly said Wednesday’s decision was related to a need to further monitor the water source, but it has been widely received as part of China’s retaliatory measures amid a deepening diplomatic row with Japan.\nAt a regular press briefing on Wednesday afternoon, the Chinese foreign ministry spokesperson Mao Ning said Japan had “failed to provide the technical documentation it committed to”.\n“I would also like to emphasise that due to [Japanese] prime minister Sanae Takaichi’s recent actions that go against the tide and her erroneous remarks on major issues such as Taiwan, which have triggered strong public outrage in China, there would be no market for Japanese seafood in the current climate even if Japan were able to export it to China.”\nBefore the 2023 ban, the Chinese market – including Hong Kong – accounted for more than one-fifth of Japan’s exports.\nThe spat started after Takaichi told her country’s parliament earlier this month that Japan could become militarily involved if China attacked Taiwan, because it would be a threat to Japan’s existence.\nBeijing claims Taiwan is a Chinese province and has vowed to annex it, with military force if it cannot coerce or convince Taiwan to accept what it calls “reunification”.\nTakaichi had been asked what would trigger Japan’s 2015 “collective self-defence” laws, which give exceptions for Japan’s postwar ban on using force to settle international disputes.\nThe remarks infuriated Beijing, which has repeatedly demanded Takaichi retract her comments, accusing her of issuing a “military threat” against China, and of pursuing a “revival” of Japan’s prewar militarism.\nTakaichi has not withdrawn her comments, although her government has said Japan’s self-defence policy has not changed. Earlier this week, she sent a high-ranking foreign ministry official to Beijing for talks, but they did not appear to lower tensions.\nChina’s foreign ministry said on Tuesday that Takaichi’s remarks “caused fundamental damage to the political foundation of China-Japan relations”.\nThe reported seafood ban comes amid a swathe of rhetorical, symbolic, and economic retaliations.\nOver the weekend, China sent a coastguard fleet through the disputed waters around the Senkaku Islands and military drones past Japan’s most westerly territory, Yonaguni Island, close to Taiwan’s east coast.\nAfter China issued a travel warning to tourists and students planning to visit Japan, almost a dozen airlines offered refunds to passengers and about 500,000 people were estimated to have cancelled flights. Shares in Japanese retail and tourism companies fell sharply on Monday. State-owned enterprises, including Chinese banks, have also reportedly told staff not to travel to Japan.\nJapanese film releases have also been suspended and numerous cross-cultural events have been cancelled. On Tuesday, China’s permanent representative to the UN, Fu Cong, told a forum that Japan was “totally unqualified” for a permanent seat on the UN security council, citing Takaichi’s remarks.\nAdditional reporting by Lillian Yang",
  "summary": null,
  "authors": [
    "Helen Davidson",
    "www.theguardian.com",
    "helen-davidson"
  ],
  "url": "https://www.theguardian.com/world/2025/nov/19/china-suspends-seafood-imports-from-japan-as-taiwan-row-escalates",
  "date_publish": "2025-11-19 08:58:02",
  "source_domain": "www.theguardian.com"
}