{
  "title": "UN to hear human rights complaint over New Zealand’s treatment of Māori",
  "maintext": "The United Nations has agreed to hear an urgent complaint against New Zealand’s coalition government alleging it is responsible for significant and persistent discrimination against Māori.\nProminent Māori leader, Lady Tureiti Moxon, has filed the complaint to the UN’s committee for the convention on the elimination of all forms of racial discrimination (CERD).\nThe complaint has been made under the ‘early warning and urgent action procedure’, which is reserved for serious violations of the convention that are escalating or require immediate attention. Anyone can submit a complaint.\nThe UN has accepted Moxon’s complaint for consideration, which may result in a request for response from the New Zealand government. It may trigger requests for further action from New Zealand, should the UN agree with Moxon’s arguments.\nThe UN has issued just one decision using this complaint mechanism for New Zealand after the controversial foreshore and seabed act in 2005 stripped Māori of their coastal rights.\nMoxon’s 42-page complaint details the history of Māori, laws that have caused Māori harm over generations, steps taken over the past 50 years to reverse some of that damage, and claims the current government has dismantled those measures.\n“We’re still fighting for the right to be Māori and live as Māori in our own country,” Moxon told the Guardian.\n“These governments make these decisions that harm and negatively impact our people, and after their term is finished, they walk away. They leave people traumatised.”\nThe minister for Māori affairs, Tama Potaka told the Guardian it would be inappropriate to comment on the complaint, until further official details were confirmed.\n“It is likely the CERD will request information from the New Zealand government. That could take some time,” Potaka said.\n“My focus remains on delivering practical results for Māori.”\nMoxon – the chair of the national urban iwi (tribes) authority and chief executive of a Māori health organisation Te Kōhao Health – has challenged the government’s policies through the courts, the human rights commission and the Waitangi Tribunal – an institution set up to consider breaches of the Treaty of Waitangi. The treaty is New Zealand’s founding document, signed in 1840 between Māori tribes and the British Crown, and is instrumental in upholding Māori rights.\nChallenging the government through local institutions has not resulted in change, so she wants the UN to intervene.\n“The injustice here is just incredible, the racism is rife, and there are no checks and balances,” she said.\nThe coalition, made up of the centre-right National party and its minor coalition partners – the libertarian Act and populist NZ First parties – has said it wants to end “race-based policies”. Since taking office in 2023, it has ushered in sweeping reforms to policies affecting Māori, including limiting the use of Māori language in public services and disestablishing the Māori Health Authority.\nIt has slashed obligations on schools and public services to take into consideration the treaty, and allowed a highly-controversial bill that sought to radically alter the way the treaty is interpreted, to be introduced to parliament. The bill was voted down at its second reading.\nThe government’s reforms have ignited the largest ever protest over Māori rights, multiple claims to the Waitangi Tribunal, judicial reviews and large nationwide meetings between Māori leaders.\nNext week, the CERD committee will examine New Zealand’s record on the elimination of racial discrimination, as part of its eight year review cycle for signatories to the convention. A delegation of officials will attend.\nMoxon will also travel to Geneva to present her complaint and hopes the review will force a change in the government’s approach.",
  "summary": null,
  "authors": [
    "Eva Corlett",
    "www.theguardian.com",
    "eva-corlett"
  ],
  "url": "https://www.theguardian.com/world/2025/nov/19/un-to-hear-human-rights-complaint-over-new-zealands-treatment-of-maori",
  "date_publish": "2025-11-19 02:00:17",
  "source_domain": "www.theguardian.com"
}