{
  "title": "Wales 7-1 North Macedonia: Close to perfect, says Craig Bellamy",
  "maintext": "The pursuit of perfection can consume some sportspeople. Logically, they know the goal itself is unattainable, but the endeavour to get there can take them to new heights.\nCraig Bellamy is one such person. He doubts whether anyone or anything can be perfect but, on Tuesday night, he saw his Wales team come close as they dismantled North Macedonia 7-1.\nThe result was one thing, the victory Wales needed to finish second in their World Cup qualifying group and secure home advantage for their play-off semi-final in March.\nThe performance was another matter altogether, a dizzying mix of expressive, ultra-attacking football played at a rapid pace, combined with a raw physical intensity off the ball which overwhelmed their opponents.\nNorth Macedonia had only conceded three goals in seven qualifiers before coming to Cardiff City Stadium. They doubled that total in the space of 19 first-half minutes, before leaving the Welsh capital humiliated.\n\"I am not a perfect person, I haven't come across anyone who is,\" said Bellamy .\n\"But maybe I take a little bit of that back because that was as close to the perfect performance as I have seen. That was incredible.\n\"The way we were able to use the ball, our timing. We didn't play with a forward, we had three [number] 10s. But they were in the position where you drag someone out and someone runs, then the wide players were connected with it as well.\n\"We were just so clean with the ball and that allows you to have good chances. It was one of those days where we are able to take them as well.\"\nThis was meant to be a tense evening in which Wales would be made to sweat by a North Macedonia side who had not conceded a single goal away from home during this campaign and only needed a draw to keep hold of second place.\nInstead, this was a game free of any anxiety as Wales blew their opponents away to create a carnival atmosphere at Cardiff City Stadium.\nThis performance was the culmination of all that Bellamy has tried to instil in his team since he took charge last year: relentless pressing out of possession and, in it, fluid forward lines and a single-minded focus on attacking.\nThis was a realisation of Bellamy's vision for Wales.\n\"I know North Macedonia will feel this one tonight, but they've been brilliant in the group,\" said Bellamy.\n\"I do feel there's been a few games they've been fortunate in and I did feel there was a team ready to hurt them, and I thought it could be us.\"",
  "summary": null,
  "authors": [
    "Dafydd Pritchard",
    "www.facebook.com"
  ],
  "url": "https://www.bbc.com/sport/football/articles/c8ey08wwyx0o?at_medium=RSS&at_campaign=rss",
  "date_publish": "2025-11-19 06:19:22",
  "source_domain": "www.bbc.com"
}