{
  "title": "Release of Epstein files awaits Trump's signoff after clearing Congress",
  "maintext": "5 hours ago\nAna Faguyon Capitol Hill\nBoth chambers of Congress agreed to order the US justice department to release its files on sex offender financier Jeffrey Epstein.\nThe House of Representatives overwhelmingly approved the measure in a 427-1 vote and the Senate unanimously fast-tracked it without a formal vote.\nThe moves come just days after President Donald Trump reversed his position and urged Congress to vote to disclose the records following public pushback from many of his supporters.\nLast week, Trump and his ties to Epstein were thrust back into the headlines after more than 20,000 pages of documents - some mentioning the president - were released. The White House denied any wrongdoing.\nRepublican Clay Higgins, of Louisiana, was the sole House objector and cited his concern about “innocent people being hurt” with the release of the information.\nTrump’s reversal from attacking those on Capitol Hill who wanted the files released to saying there was “nothing to hide” surprised some in Washington.\nThe Republican congressional leadership was caught off guard after aligning their message with the president for the past few weeks and opposing the release.\nHouse Speaker Mike Johnson had repeatedly called the push to release the Epstein files a \"Democrat hoax\".\nOn Tuesday, he voted in support of release.\nWhat do we know about the Epstein files?\nEpstein saga reveals Republican rifts - and the power of Trump's base\nThe only 'no' vote on releasing Epstein files\nThe measure had been expected to take a few days to reach the US Senate, but after the resounding afternoon vote in the House, the timeline quickly sped up.\nSenate Minority Leader Chuck Schumer brought up the bill on the floor of the Senate under a procedure called unanimous consent. Because no one objected, there was no debate and no amendments added to the bill.\nIt will head from the Senate to the president‘s desk, where he is expected to sign it into law.\nA congressional vote was not required to release the files - Trump could have ordered the release on his own.\nThe bill requires Attorney General Pam Bondi to release “all unclassified records, documents, communications, and investigative materials” related to Epstein and his co-conspirator Ghislaine Maxwell no later than 30 days after the law is enacted.\nThose materials include internal justice department communications, flight logs and people and entities connected to Epstein.\nBut the bill also gives Bondi the power to withhold information that would jeopardise any active federal investigation or identifies any victims.\nEpstein, a financier, was found dead in his New York prison cell in 2019 in what a coroner ruled was a suicide.\nHe was being held on charges of sex trafficking, having previously been convicted of soliciting prostitution from a minor in 2008.\nDuring two criminal investigations into Epstein, thousands of documents were gathered, including transcripts of interviews with victims and witnesses.\nTrump and Epstein previously socialised in similar circles, but the president said he cut ties with Epstein many years ago, before his 2008 conviction. The president also said he was unaware of Epstein’s criminal activity.\nLast week, Democrats on the House Oversight Committee published three email chains, including correspondence between Epstein and Maxwell, who is currently serving a 20-year prison sentence for sex trafficking.\nSome of those make mention of Trump, including one email, sent in 2011, in which Epstein wrote to Maxwell: “I want you to realize that that dog that hasn’t barked is Trump.. [VICTIM] spent hours at my house with him.”\nThe White House said last week that the victim referenced in the email was prominent Epstein accuser Virginia Giuffre.\nGiuffre, who died in April, said that she never saw Trump participate in any abuse and there is no implication of any wrongdoing by Trump in the emails.\nSpeaking after the vote, Giuffre's brother Sky Roberts praised her sister's role in seeking justice for Epstein survivors.\n\"She did it, she paved the way... She paved the way for us to come forward as advocates, for her survivor sisters to come forward, and we won't stop,\" Roberts said.\nTrump has consistently denied any wrongdoing in relation to Epstein. White House Press Secretary Karoline Leavitt said the emails were \"selectively leaked\" by House Democrats to \"liberal media to create a fake narrative to smear President Trump\".\nThe push for the release of the investigative files held by the Department of Justice was led by Republican Thomas Massie, a Kentucky congressman who sometimes dissents from his party, and Democrat Ro Khanna, a California congressman, both of whom introduced the legislation.\nMassie has faced criticism from Trump for his push to release the files, but has stood firm.\n“In 2030, he’s not going to be the president,” Massie said to ABC News over the weekend. He added that fellow Republicans who voted against release \"will have voted to protect paedophiles”.\nAnother Republican who has pushed for the release of the files is House Representative Marjorie Taylor Greene. She had been a staunch supporter of Trump before the two fell out over the issue, with the president now calling her a \"traitor\".\nAt a news conference earlier in the day on Tuesday, Greene said she is speaking up on behalf of Epstein's survivors. She also called out Trump directly.\n\"Let me tell you what a traitor is. A traitor is an American that serves foreign countries and themselves; a patriot is an American that serves the United States of America and Americans like the women standing behind me,\" Greene said.\nShe said that row over Epstein has been one of the \"most destructive things\" to Trump's Make America Great Again movement since his election in 2016.\nSurvivors of Epstein’s abuse also spoke at the news conference, urging lawmakers to release the files and pushing Trump to do the same.\nEpstein survivor Annie Farmer said that keeping the files under wraps amounted to “institutional betrayal”.\n“Because these crimes were not properly investigated, so many more girls and women were harmed,” Ms Farmer said.",
  "summary": null,
  "authors": [
    "Ana Faguy"
  ],
  "url": "https://www.bbc.com/news/articles/cdxr1r34ev9o?at_medium=RSS&at_campaign=rss",
  "date_publish": "2025-11-18 23:45:43",
  "source_domain": "www.bbc.com"
}