{
  "title": "Sarina Wiegman on Mary Earps book: England coach responds",
  "maintext": "Sarina Wiegman does not think she \"would have done things differently\" despite criticism from Mary Earps about the England manager's choice of starting goalkeeper at Euro 2025.\nThe former England goalkeeper claims in her autobiography she told Wiegman she was rewarding \"bad behaviour\" when Hannah Hampton was recalled to the squad after previously being dropped for being \"disruptive and unreliable\".\nEarps' views in her book have come under scrutiny, with Chelsea manager Sonia Bompastor among those to defend Hampton and Wiegman.\nThe 32-year-old announced her shock retirement from international football just five weeks before England began their European Championship defence in Switzerland.\nWiegman, who has twice guided England to the Euros title, confirmed she had not spoken to the Paris St-Germain player since her book was made public.\n\"We had a very good goalkeeper unit and the two were competing for the number one spot. I think I would have done exactly the same thing,\" said Wiegman when asked if there was anything she had learned from the situation.\n\"We kept communicating every time. As always, we try to support in the best possible way and I can't control how that comes across.\n\"There are always learnings but I don't think, in the bigger picture, I would have done things differently.\"\nWiegman said she \"can't control\" what Earps says or feels about her decisions but the England coach emphasised she made the decisions to give the side the best chance of success.\nEngland take on China at Wembley Stadium on 29 November before hosting Ghana at St Mary's Stadium on 2 December.\nThe media conference to announce her squad was dominated by questions about Earps and Wiegman joked it would be \"nice to talk about football\".\nThe return of Manchester City forward Lauren Hemp and midfielder Grace Clinton are the headline stories in Wiegman's 25-player squad for the friendly matches.\nBut former Netherlands coach Wiegman accepted that dealing with adversity is part of her high-profile role.\n\"Of course you hope that things are always positive but that's not how things work in football when you're so visible,\" she said.\n\"It's just the situation and you're trying to deal with it in the best positive way, solve whatever needs to be solved, and move forward.\n\"I make decisions on what I think is the best for the team to compete in the next camp or the next tournament - and I make decisions to win.\"\nWiegman was also asked if she was disappointed that Earps said her affinity to the Lionesses manager was \"destroyed\" and her \"trust and respect was evaporating\".\n\"I don't think I can change that. What I just try to be is as honest as possible and have a very good working relationship, which is what I think we had,\" she added.\n\"I can't control other things. I just stick with what I want to do, how I want to do it and try to be as clear and honest as possible to make decisions to win.\n\"I always keep conversations private. I share things here [in the media] but when I have individual conversations I keep that private as that builds trust.\n\"If I do that then players will come to me and have conversations with me. That's my approach. We create an environment where we want people to be themselves.\"\nChelsea goalkeeper Hampton is not in the squad for the final two England matches of the year after picking up a thigh injury.\nThe 24-year-old won the Yashin Trophy for best goalkeeper at this year's Ballon d'Or awards, and was one of the standout performers at Euro 2025.\nWiegman confirmed she had spoken with Hampton following Earps' book release but did not go into details on their conversations.\n\"I spoke to Hannah. I speak to players in between camps anyway. Unfortunately, she is injured now. But I did speak to her, yes,\" added Wiegman.\n\"What the content of that conversation was, as always, I'll keep private.\"",
  "summary": null,
  "authors": [
    "Emma Sanders",
    "www.facebook.com"
  ],
  "url": "https://www.bbc.com/sport/football/articles/cx24092wpy0o?at_medium=RSS&at_campaign=rss",
  "date_publish": "2025-11-18 12:37:21",
  "source_domain": "www.bbc.com"
}