{
  "title": "Our son's about to turn three",
  "maintext": "Our son's about to turn three - finding new childcare has left us at our wits' end\n4 hours ago\nVanessa ClarkeEducation reporter\nMonika and Henry Byrne are in a tricky situation. In six weeks, their son Leo will have to leave his current childcare provider after he turns three years old.\nThey are one of a growing number of families struggling to find childminder or nursery places, with many childminders now saying they can no longer afford to take on three- and four-year-olds because of lower government funding rates for older pre-school children.\nOverall, the number of childminders is falling too, with one charity warning that there could be none left by 2033.\nThe government says childminders can use funding flexibly - not just for a particular age group - and that \"many could benefit from growing demand for places\".\nBut mum Monika, a quantity surveyor based near Milton Keynes, said she had \"no idea how difficult it would be\" to find a new place for their son.\n\"After the tenth 'no' from a nursery or childminder, I broke down,\" she said.\nThe couple, who contacted Your Voice, Your BBC News to share their story, thought the government funded hours were \"a Godsend\".\nBut Henry says it only works when there are spaces available.\n\"If the childminders don't feel they're getting adequately compensated, then it gets pushed back onto the parents. We don't have family around and we're really at our wits' end.\"\nAlthough the family has now secured a potential place for Leo in January, it is only for three days a week - meaning they are now having to discuss flexible work arrangements with their employers.\nThe number of childminders has been falling for a decade, from almost 48,000 in 2015 to 25,000 in 2025, new Ofsted figures suggest. There were 1,000 fewer childminders in 2025 than in 2024, a fall of 4%.\nIt comes at a time when demand is rising, as more working parents are now eligible for 30 government-funded hours of childcare for children from nine months old during term time in England.\nHundreds of childminders say they are now restricting or opting out of caring for three- and four-year-olds, according to a survey by Coram PACEY, the Professional Association for Childcare and Early Years.\nKa Lai Brightley-Hodges, head of the charity, says those childminders would want to offer those places if it was \"properly funded\".\nThat would allow them to offer continuous care from nine months old all the way through to school age, she said.\nIn her home in Carlton in Yorkshire, childminder Georgina Young makes gingerbread men with two four-year-olds she has cared for since they were babies.\n\"I am running at a loss, the funding is less than I would normally get an hour,\" she says.\n\"There is not another job out there where you work really, really hard and you are rewarded with a pay cut.\"\nJudy Wylde, who lives on the Wirral, says the rate paid for three- and four-year-olds is \"atrocious\".\nShe has been childminding for 35 years and spends a lot of her time in play centres, the museum and the library. She says she saves so she can cover the shortfall when they reach three years old.\nThat's because the amount the government pays for older pre-school children is less than for children under two.\nBoth Judy and Georgina believe the funding for the government's expansion has left childminders behind in comparison to nurseries, as they work with different staff-to-child ratios.\nSome rules for childminders have been relaxed. They can now work from community or village halls, and the total number of people allowed to work together has increased.\nBut Judy and Georgina want to see further changes - including the rule that says childminders cannot be related to the children they care for.\nNext year, Judy won't be able to continue looking after her grandson Louie, because his parents will qualify for government-funded hours.\n\"It irritates the life out of me,\" she says.\n\"I have an amazing bond with Louie, but I cannot do it as a freebie. He is taking up a space and this is my only income since my husband passed away.\"\nGeorgina similarly says she would love to look after her nephew, who turns one next week, but she cannot afford to do it for free.\n\"My sister's had to start looking at childcare options and she was really upset, because obviously she wanted to send him to me.\"\nThe issues are affecting both childminders and parents alike.\nChildcare spaces overall increased by 1% in 2025 – mainly due to the expansion of private nurseries and preschools.\nBut the government has admitted parents may not get their first choice.\nFor Kirstie Osborne, the lack of spaces is a real concern.\nThe mum-of-two was made redundant while on maternity leave. Many of the jobs she's eligible for require her to start immediately, or within three months.\nBut the earliest nursery space she can find near where she lives in the West Midlands is for September 2026.\n\"Now I am frozen out of even applying for jobs,\" she says.\n\"It's like you can't get back in, the door is shut and locked.\"\nA government spokesperson said ministers were \"backing the sector with £8bn in funding this year\" and said the early years workforce had \"grown significantly\".\nChildminders provide \"flexible, high-quality care that families value\", they added.",
  "summary": null,
  "authors": [
    "Vanessa Clarke"
  ],
  "url": "https://www.bbc.com/news/articles/cd0490erp13o?at_medium=RSS&at_campaign=rss",
  "date_publish": "2025-11-19 05:59:38",
  "source_domain": "www.bbc.com"
}