{
  "title": "Cop30: UN accused of crackdown on Indigenous people - as it happened",
  "maintext": "Key events\nShow key events only\nPlease turn on JavaScript to use this feature\nThe blog is done for today - here’s what happened on day seven at Cop30\nMore than 200 human rights and environmental groups have accused the UN climate chief Simon Stiell of encouraging a state crackdown on Indigenous people at the climate talks. The open letter accused Stiell of “creating a chilling effect and a feeling of unsafety for Indigenous peoples, environmental and other human rights defenders, civil society, and activists standing up for their rights.”\nCoal giant South Korea joined a group of 60 countries pledging to wean itself off the dirtiest of dirty fossil fuels.\nColombia, a member of the Fossil Fuel Non-Proliferation Treaty Initiative, announced plans to host a first international conference on the phase out of fossil fuels in April next year.\nA new UN Environment Programme report showed that emissions of methane, a very potent greenhouse gas, are still rising, though at a slightly slower rate than before.\nVicente Fernandes Vilhalva, an Indigenous Guarani Kaiowá leader, was shot dead on Sunday morning, confirming Brazil’s inglorious record as among the deadliest countries for land rights and environmental defenders.\nMy colleague Ajit Niranjan will be back with you in the morning for day eight. Until then, get some rest, there’s still a way to go. Descanse um pouco, ainda há um longo caminho a percorrer.\nShare\nAbsolutely terrible news of another Indigenous land defender killed in Brazil.\nVicente Fernandes Vilhalva, a 36-year-old Guarani Kaiowá leader, was shot dead on Sunday morning. Four others were reportedly injured in the attack by a group of armed assailants on Pyelito Kue, a community of Guarani Kaiowá people who recently reoccupied part of their ancestral land in southern Brazil. This is the fourth assault against the Pyelito Kue community in recent weeks, where disputes with ranchers over their ancestral land go back decades, according to Survival International.\nA community member speaking anonymously, told Repórter Brasil:\nWe were surrounded. The gunmen didn’t come to talk, they just started shooting. We have no weapons, we have no chance of defending ourselves. We retreated and went to the village, but they kept shooting…. They burned everything in the reclaimed area: our shacks, pots, chairs...”\nA statement by the Guarani Kaiowá organization Aty Guasu said:\nWe, the Guarani Kaiowá Indigenous peoples, condemn the attacks that took place in Tekoha Pyelito Kue, which resulted in the murder of a leader. Our struggle is for life, for land, and for ‘Tekoha Guasu’ (our complete ancestral territory). We no longer accept being treated as invaders on our own land.”\nLatin America is the deadliest region in the world for land rights and environmental defenders, accounting for 82% of those killed in 2024 - including 12 in Brazil, according to Global Witness.\nThe killing of Vicente Fernandes Vilhalva comes amid mounting anger at the deployment of armed security forces to the Cop30 venue in response to Indigenous-led peaceful protests demanding to have their struggles over land and water be heard.\nShare\nUpdated at 20.33 GMT\nDamian Carrington\nMy colleague Damian Carrington, the Guardian environment editor, has been doing some very serious field work. Here are his important tongue-in-cheek ratings of the national pavilions – where countries set out their climate wares and hold events. The pavilions are very varied in style and size, and they cost a lot to rent, giving rich nations an advantage.\nUK: Union flag is present and correct, and a red-faced man on TV, plus surprisingly good (Brazilian) coffee.\nMalaysia: Real plants - a treat in the windowless, soulless conference centre.\nIndonesia: Dull pavilion, awesome outfits.\nAzerbaijan: All glitz and no content. A bit like Cop29.\nItaly: They seem to have recreated some ugly Roman steps. But then places to sit are scarce at Cops, so clever.\nGermany: A kind of wooden fort. No-one knows why.\nTurkey: Awkwardly sited next to Australia, its rival to host Cop31. Winning the pavilion game by giving out pretty tote bags and having a calligrapher to beautifully write your name.\nChina: Enormous as you’d expect. And with its own great wall.\nSingapore: Genuinely pretty!\nThe research will continue tomorrow…\nShare\nUpdated at 20.12 GMT\nDamien Gayle\nHundreds of human rights organisations and environmental groups have accused the UN climate chief Simon Stiell of encouraging a crackdown on Indigenous people at the Cop30 climate talks in Belém.\nAn open letter signed by 201 groups said Stiell’s demand that security be beefed up following a protest at the summit last Tuesday had led to a militarised “silencing of dissent” and the “marginalisation of those defending land and the environment”. It said:\nThe consequence of [your] letter has been a massive escalation of security force presence in and around Cop30, creating a chilling effect and a feeling of unsafety for Indigenous peoples, environmental and other human rights defenders, civil society, and activists standing up for their rights.”\nThe groups’ letter warned that even if Brazil chose not to escalate its oppression of civil society groups around Cop30, Stiell’s demands set a dangerous precedent by “granting a broad and permissive mandate to future COP presidencies that may not exercise the same restraint”, and risked “signalling that expansive security responses to peaceful protest are acceptable within the UNFCCC context”.\nOn Monday morning, the first day of the second week of Cop30, hundreds of military police were stationed around the Belém city park, where the conference centre is located. The lines of security forces blocked roads leading to the summit, creating a wide cordon that had to be negotiated before it was possible to even get within sight of the talks, reports Damien Gayle, environment correspondent.\nThe security operation came as Indigenous groups staged a protest march in the streets of Belém, complaining that despite its being given the moniker “the Indigenous Cop” their voices and perspectives were being excluded from the talks.\nThe open letter to Stiell was signed by Amnesty International, Friends of the Earth, the Indigenous Environmental Network and the International Federation for Human Rights (FIDH) among other groups. It said:\nIndigenous peoples defending and demanding legal recognition of their land and their right to self-determination, and protecting our ecosystems and planet, are not a threat. Indigenous women with children demanding access to the negotiations that are determining their future, are not a threat. Such demonstrations are not acts of disruption but expressions of Indigenous peoples’ collective political will, grounded in their self-governance systems, cultural traditions, and worldviews.\nThreatening is the massive presence of security forces, especially in a global context of growing violence against environmental defenders, including in the host country.\nA statement issued by the International Indigenous Peoples Forum on Climate Change (IIPFCC) points out that the deployment of troops “is replicating the form of state violence Indigenous Peoples and human rights defenders face across our territories.”\nHugo Gabbero, director of the International Federation for Human Rights’ defenders protection desk, added:\nWhat is happening at COP30 is very concerning. A UNFCCC letter triggered a massive security escalation in Belém, intimidating Indigenous Peoples and silencing the right to peaceful protest. Indigenous defenders are protecting the planet, and they must never be sidelined in climate action. We urge the UNFCCC to️ reduce securitisation around the conference and recognise the central role of Indigenous Peoples in real solutions to the climate crisis.\nShare\nTo mark the halfway point of Cop30 - the moment when high-level government ministers take the driving seat in the negotiations - some of the world’s most climate vulnerable nations have been urging the countries most responsible for greenhouse gas emissions to fulfill their legal obligations, and do more on mitigation and finance.\nMatthew Samuda, Jamaica’s economic growth minister, described Hurricane Melissa, the category 5 storm that three weeks ago left dozens dead and displaced hundreds of thousands of people, “the new phase of climate change.”\nHurricane Melissa changed the life of every Jamaican in less than 24 hours. We did not create this crisis, but we refuse to stand as victims. “We call on the global community, especially major emitters, to honor their commitments and safeguard the 1.5 degree threshold for Jamaica. This is survival. It’s about our people and their right to a safe and prosperous future.\nCuba was also hit by torrential rains, massive flooding and winds up to 180 mph from Melissa, causing widespread damage to homes and infrastructure, leaving hundreds of thousands have lost access to safe water and electricity. Armando Rodriguez Batista, Cuba’s environment and science minister, said:\nTomorrow it will be too late to do what we had to do a long time ago.\nMauritius foreign affairs minister Dhananjay Ramful said.\nOur very existence is at stake. A decade after the promises of the Paris Agreement, despite our good intentions, we realized that we have not done enough. ... Our planet demands action now.\nShare\nThe landmark climate ruling from the International Court of Justice (ICJ) in July put the R word, reparations, slap bang in the middle of climate accountability - precisely where the big polluting states don’t want it.\nThe ICJ concluded that states have a legal obligation to prevent climate harm, and that countries and individuals harmed by a breach of this duty may be entitled to reparations - physical restitution, financial compensation and/or formal apologies for wrongdoing (satisfaction). This duty under international law, sits above and beyond the Paris Agreement which explicitly states loss and damage “does not involve or provide a basis for any liability or compensation” – a get-out-of-jail card that major polluters have tried to use to avoid discussing reparations.\nI say this as a lead in to a brilliant recent piece by Natricia Duncan, our Caribbean correspondent: Hurricane Melissa a ‘real-time case study’ of colonialism’s legacies. Destruction in Jamaica shows why climate justice cannot be separated from reparatory justice.\nCold Spring village, and many of its neighbouring communities in Hanover, where residents are still coming to terms with catastrophic destruction, were once plantations owned by Europeans who amassed wealth from centuries of trafficking and enslavement of African people. One of the Guardian’s 19th-century funders co-owned a plantation, Success, in the area. For the last few years, the Legacies of Enslavement Programme has been engaging with these communities to discuss priorities for repair.\nAt the ongoing UN Cop30 climate change conference in Brazil, campaigners say that devastated regions such as Hanover as well as others across Jamaica, Cuba and Haiti, are stark examples of how African descendants are disproportionately affected by centuries of environmental degradation.\nSpeaking from Cop30, Jamaican economist Mariama Williams said historical injustices must be confronted and addressed.\nThe research shows that wherever Afro descendants are located, they are most vulnerable to climate and environmental impact and have been suffering from historical environmental injustice and climate injustice,” she said. “Climate justice cannot be separated from reparatory justice. The same systems that enriched the north created today’s vulnerabilities.\nShare\nDamian Carrington\nMethane is sometimes called the climate “emergency brake” – because it’s both a potent greenhouse gas and only lasts about 20 years in the atmosphere. So cutting emissions would have a large and fast effect on slowing global heating. CO2 stays in the air for about a century, writes Damian Carrington, Guardian environment editor.\nBut the UN Environment Programme report presented at Cop30 today shows the world is not pulling that brake: emissions are still rising. Most human-caused emissions come from leaky fossil fuel infrastructure, cattle, rice fields and waste dumps.\nThe good news is that the rate of rise is slowing as attention has focused on methane emissions, not the least satellite detection of super-plumes from oil and gas sites. UNEP’s analysis found that the policies and pledges made by nations to date will cut methane by 8% by 2030. That is short of the 30% by 2030 target of the Global Methane Pledge, backed by 159 countries, but would at least be progress.\nThe other good news is that the technology needed exists and the benefits of cutting methane outweigh the costs. Action can even turn a profit, if the captured fossil gas is then sold. Dan Jørgensen, the European commissioner for energy, said:\nAcross sectors and continents, countries and companies are proving that methane reductions are achievable – and deliver cleaner air, stronger economies, and a safer climate. Our task now is to scale these solutions rapidly.\nThere’s a great explainer here by my colleague Fiona Harvey if you want to know more. “Cutting carbon dioxide is a marathon, but methane is a sprint,” Durwood Zaelke, at the Institute for Governance and Sustainable Development told her.\nShare\nDamian Carrington\nThe EU defends its planned carbon tax\nA flashpoint here at Cop30 is a row over a European Union policy to charge a carbon tax on goods imported into the bloc if they don’t match EU standards of clean production. The idea is to stop high-polluting industries simply relocating out of the bloc to avoid climate regulations, so-called carbon leakage.\nChina, India and Saudi Arabia are among the countries deeply opposed. Some opponents say it discriminates against nations at an earlier stage of economic development.\nBut EU climate commissioner Wopke Hoekstra firmly defended the Carbon Border Adjustment Mechanism, which comes into force in January, saying it was an essential part of the EU’s climate toolbox and was being phased in gradually. He denied it was a “unilateral trade measure”, jargon for a discriminatory trade practice. “The best CBAM is one that doesn’t make any money,” he said.\nHoekstra also praised an initiative to coordinate carbon markets in the EU, China and Brazil announced at Cop30 - some observers think this technical measure could have a profound impact on accelerating the transition to clean energy. Putting a price on carbon emissions gives a clear incentive to polluters to cut CO2 as efficiently and quickly as possible. Widespread carbon pricing “would be potentially the biggest game changer that we could unleash in the years to come,” he said.\nDenmark currently holds the presidency of the European Union and its climate minister announced at Cop30 on Monday that it was setting for itself the most ambitious carbon target in the developed world - cutting CO2 pollution by 82% by 2035. (The UK target is 81%.) Lars Aagaard said:\nWe will demonstrate to the rest of the world that it is possible to balance an ambitious climate target with a competitive business sector and strong social cohesion.\nShare\nDamien Gayle\nAs the second week of the circus surrounding Cop30 gets under way in Belém, civil society leaders have issued a stinging denunciation of the role played by the UK and other global north countries in the negotiations so far, reports my colleague Damien Gayle.\nSpeaking at a press conference in the summit’s blue zone restricted area, they described how wealthy countries’ delegations were obstructing moves towards a just transition, and trying to shift the burden of transition on to the developing world.\nDespite their claims of climate ambition, governments of the global north were failing to live up to their promises to end their reliance on fossil fuels, and were pressuring global south countries to move faster despite having enriched themselves from centuries of coal, oil and gas exploitation, speakers said.\nLidy Nacpil, of the Asian People’s Movement for Debt and Development, said:\nI have been to 17 Cops and throughout these many years, it’s been the same story, the same claims, the same hypocrisy – we call it climate hypocrisy – that we see, especially from the governments of developed countries or the global north.\nNacpil said she and colleagues had analysed countries’ Nationally Determined Contributions – their national plans to reduce emissions – over the past decade.\nOver the 10 years, our study shows that the biggest gap between what must be delivered as their fair shares and what has actually been delivered is that of the global north. I think for many of us this is not surprising. But this has to be repeated in view of the fact that they are claiming to be the champions of ambition.\nMeena Raman of the Third World Network said that global north countries were being evasive around questions of climate finance – the provision of which is laid out in Article 9.1 of the Paris Agreement.\nThey do not want to talk about their financial obligations\nNow, I’m not sure whether the global north understand English, but it’s so clear that [Article 9.1] says that developed countries shall provide finance for mitigation and adaptation - and there’s also a responsibility for loss and damage finance.\nBut what we see happening here [is that] we have the developed world having the gall to say that ‘why is everything on ambition, particularly on mitigation, linked finance?’\nBut that’s what the Paris Agreement says! This is respecting the principle of common but differentiated responsibility. It’s about their historical emissions which are responsible for their obligations. This is not charity, this is not overseas development assistance.\nShare\nUpdated at 21.07 GMT\nLet’s kick off with a reminder of why any of this matters.\nAs political leaders debate whether now is finally the right time to take decisive action on fossil fuels, extreme weather supercharged by the burning of oil, gas and coal is causing death and destruction in communities across the world.\nIn Gaza, heavy rain is compounding the humanitarian disaster for displaced Palestinians seeking refuge in tents and other woefully inadequate makeshift shelter, according to the United Nations agency for Palestinian refugees (UNRWA).\nRainfall inundated sprawling encampments across Gaza on Saturday, converting dirt roads into contaminated waterways, and soaking freezing families sheltering in tents with their belongings.\nIsrael has destroyed or damaged more than 80% of all buildings and homes since launching its full scale assault in October 2023, as well as razing farmland, gardens and other vegetation that helps absorb rainwater and control flooding. Israel has killed dozens of Palestinians since the supposed ceasefire deal last month, while continuing to block entry of tents and mobile homes into the enclave.\nRefugees and other forcibly displaced people are among the most vulnerable to climate disasters, according to a report by the UN refugee agency last week. The number of countries reporting both conflict and disaster-related displacement has tripled since 2009.\nIn Europe, heavy rains and high winds from Storm Claudia left at least three people dead in Portugal and dozens injured in Spain and Portugal, as well as causing major damage in parts of the UK. People in the town of Monmouth in Wales were submerged under water over the weekend after the River Monnow burst its banks. This comes after flash floods killed at least 237 people in Valencia in late October, making it one of the deadliest weather-related disasters to ever hit Spain.\nMeanwhile, the climate crisis is causing a different sort of disaster in Iran. Only 1mm of rain has fallen in the capital Tehran this year, a place where the average annual rainfall between 1991 and 2000 was 350mm, and signals the sixth straight year of drought. As my colleague Patrick Wintour in Tehran reports, authorities have rationed supplies, launched cloud seeding operations and are weighing up evacuating parts of the capital. Prayers for rain are being held across the country.\nSeven weeks into the start of Iran’s rainy season and more than 20 provinces have not yet had a drop, and the number of dams with less than 5% of their reservoir capacity has risen from eight to 32. Snow cover has decreased by 99% nationwide compared with the same time last year, and in Tehran the temperature has been a balmy 20C in what is the cold season.\nRather than talk about fossil fuels and the climate crisis, some religious leaders have suggested that drought is a message from God. Iran has the world’s third-largest proven oil reserves and second-largest natural gas reserves. Its per capita CO2 emissions were 9.6 metric tons in 2024, compared to 5.6 tCO2e in the EU27 and 13.6 tCO2e in the US.\nShare\nHello, this is Nina Lakhani the Guardian’s climate justice reporter in NYC, taking over from my lovely colleague Ajit Niranjan in Berlin.\nShare\nDamian Carrington\nSaudi Arabia\nHere’s an in-depth look at why Saudi Arabia is the biggest obstructor of climate action at UN Cop summits, by Guardian environment editor, Damian Carrington.\nCan you imagine someone giving you $170,000? What would you buy?\nCan you imagine getting another $170,000 one minute later? And the handouts then continuing every minute for years? If so, you have a feel for the colossal cash machine that is Saudi Arabia’s state oil company Aramco, the world’s biggest producer of oil and gas last year.\nThat tidal wave of cash keeps the authoritarian kingdom afloat, as it lavishes money on fossil fuel subsidies for its citizens, soft power projects like the football World Cup and mind-boggling construction projects.\nBut it is also why the drive for accelerating climate action, principally getting the world off fossil fuels, is seen as an existential threat to Saudi Arabia: its economy and even its ruling royal family.\nFor decades, Saudi Arabia has fought harder than any other country to block and delay international climate action – a diplomatic “wrecking ball” saying that abandoning fossil fuels is a fantasy. Yet the country is now also making a whirlwind switch to renewable power at home.\nIn another contradiction, slowing climate action worsens the impacts on a desert kingdom that is extremely vulnerable to global heating and where its 36 million people already contend with conditions “at the verge of livability”.\nHow can these contradictions be understood, and can countries desperate to fight a climate crisis that is already killing a person a minute outflank Saudi obstruction? “The Saudis are not crazy.” says Karim Elgendy, an expert on climate and energy in the Middle East. “But they don’t want to be a failed state.”\nSaudi obstruction has continued at Cop30, for example in discussions on Saturday about the Global Stocktake – the work that the chasm between the cuts in carbon emissions needed and those being pledged.\nA group of nations including the UK, EU and small island states proposed highlighting important elements from previous reports in a new text, including the urgency of keeping 1.5C within reach and addressing the emissions gap. The Arab group, of which Saudi Arabia is the dominant member, and the African group opposed the inclusion of any such elements.\nFormer US vice president Al Gore called out Saudi blocking tactics at Cop30: “I hope that the rest of the world will stand up to this obscene greed and recklessness on the part of the kingdom.”\nShare\nDamien Gayle\nThe push for a “just transition” to a clean economy has been gaining momentum, with growing support from civil society and developing countries for the creation of a “Belem Action Mechanism” as a formal body under the UN’s climate change framework. My colleague Damien Gayle spoke to one activist about what that means in practice.\nShare\nSometimes it is easy to forget what diplomats spewing acronyms at climate negotiations are doing it for. This is Neha Singh’s story, as told to journalist Anuradha Nagaraj.\nEvery morning, I am up by 5.30am-6am because I have to cook, get ready, and leave on time for our shift, which begins at 8.30am. But this summer – May, June, July and August – the temperature always stayed around 46C, sometimes even hitting 50C (122F). My routine changed.\nI live in a rented room with a friend on the top floor of a two-storey building. We had frequent power cuts in our rural neighbourhood those days, with lights often going off at 3am.\nWe would not get a good night’s sleep but would still get up by 6am to try to have a bath early before the water in our tank on the roof would become very hot. We would not feel like cooking because our top-floor room was so hot. I would have a cold drink instead of a cup of tea.\nThe company is around 3km from where I stay and getting an auto [autorickshaw] is difficult. So, I walk to work. The streets would be deserted, with shops closed and everyone inside their homes. Our 30-minute walk has no shaded area, no place to sit and rest. We just walk and walk, the sun directly on us, till we reach the company drenched in sweat.\nInside, there is some cooling. There was a difference of almost 10C. And I would drink the cold water available here since at home we did not have a filter and drank the tank water, which was very hot. Then I did my shift.\nRead the full story here.\nShare\nDamian Carrington\nThere’s an intriguing line in the update note put out by the Brazilian Presidency of Cop30 on Sunday evening – my colleague Fiona covered the key points here.\nThe line is: “Expectation that the Paris Agreement will once again achieve near universal membership and coverage of global emissions.”\nThat is a veiled reference to the US, the world’s second biggest polluter, and which under Donald Trump has pulled out of the Paris Agreement and failed to send anyone to Belém. It says consensus of views from the nations actually at Cop30 is that the US will rejoin after the Trump era ends.\nShare",
  "summary": null,
  "authors": [
    "Ajit Niranjan",
    "Nina Lakhani",
    "Damian Carrington",
    "Damien Gayle",
    "Jonathan Watts",
    "Adam Morton",
    "Fiona Harvey",
    "www.theguardian.com",
    "ajit-niranjan",
    "nina-lakhani"
  ],
  "url": "https://www.theguardian.com/environment/live/2025/nov/17/cop30-belem-brazil-global-warming-latest-news-updates",
  "date_publish": "2025-11-17 21:03:36",
  "source_domain": "www.theguardian.com"
}