{
  "title": "Americanswers… on 5 Live! Has Donald Trump changed his mind on the Epstein Files?",
  "maintext": "Available for over a year\nOn Sunday night Donald Trump told Republicans in the House of Representatives to vote in favour of releasing files relating to the late convicted sex offender Jeffrey Epstein “because we have nothing to hide”. It’s a striking change in position from the president who has so far resisted pressure from Democrats and Republicans in his own party who have been demanding that all files relating to Epstein be released into the public domain. One of the Republicans calling for their release is the conservative firebrand and Republican congresswoman Marjorie Taylor Greene, who was once one of Trump’s most faithful supporters. After stepping up her demands to see the files released, she now appears to have lost the president’s backing who called her a “traitor” and a “disgrace” to the Republican Party. We answer your questions on why the pair have fallen out. And, we answer your questions on why there’s been another presidential pardon, this time for the UK billionaire Joe Lewis, whose family trust owns Tottenham Hotspur Football Club. Sarah, Anthony, Justin and Marianna all joined Matt Chorley on 5 Live today to answer these questions and plenty more. HOSTS: * Matt Chorley, 5 Live presenter * Sarah Smith, North America Editor * Justin Webb, Radio 4 presenter * Anthony Zurcher, North America correspondent * Marianna Spring, Social Media Investigations correspondent GET IN TOUCH: * Join our online community: https://discord.gg/qSrxqNcmRB * Send us a message or voice note via WhatsApp to +44 330 123 9480 * Email Americast@bbc.co.uk * Or use #Americast This episode was made by George Dabby with Grace Reeve and Laura Cain. The technical producer was Michael Regaard. The series producer is Purvee Pattni. The senior news editor is Sam Bonham. If you want to be notified every time we publish a new episode, please subscribe to us on BBC Sounds by hitting the subscribe button on the app. You can now listen to Americast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Americast”. It works on most smart speakers. US Election Unspun: Sign up for Anthony’s BBC newsletter: https://www.bbc.co.uk/news/world-us-canada-68093155 Americast is part of the BBC News Podcasts family of podcasts. The team that makes Americast also makes lots of other podcasts, including Newscast and Ukrainecast. If you enjoy Americast (and if you're reading this then you hopefully do), then we think that you will enjoy some of our other pods too. See links below. Newscast: https://www.bbc.co.uk/sounds/series/p05299nl Ukrainecast: https://www.bbc.co.uk/sounds/brand/p0bqztzm Radical: https://www.bbc.co.uk/sounds/brand/p0gg4k6r The Global Story: https://www.bbc.co.uk/sounds/brand/w13xtvsd\nProgramme Website",
  "summary": null,
  "authors": [],
  "url": "https://www.bbc.co.uk/sounds/play/p0mh6kdc?at_medium=RSS&at_campaign=rss",
  "date_publish": "None",
  "source_domain": "www.bbc.co.uk"
}