{
  "title": "British woman among four tourists killed in blizzard at nature reserve in Chile",
  "maintext": "A British woman and four other foreign tourists have been killed in a blizzard at a nature reserve in southern Chile.\nNine people went missing on Monday in the Torres del Paine reserve in Patagonia, a popular tourist destination, amid heavy snowfall and winds reaching up to 120mph.\nFour were rescued alive from a remote area in the mountains, but it was confirmed on Tuesday afternoon that two Mexicans, two Germans and a British woman had died.\nA total of 24 people were involved in the search – including police officers, soldiers, mountain rescue, and a search dog – but helicopters were unable to fly due to the adverse weather conditions.\nThe presidential delegate of the Magallanes region, José Antonio Ruiz, said: “We are in the process of evacuation and consular procedures, due to the nationality of these people.”\nHe added that preparations were under way to evacuate the bodies by air, when the weather was good enough for helicopters to operate safely.\nThe national park in southern Chile featuring mountains, glaciers and rivers is a popular spot for explorers. In 2024, more than 367,000 tourists visited the reserve, a rise of almost two-thirds compared with the previous year.\nGuillermo Ruiz, presidential delegate for the province of Ultima Esperanza, told reporters that the tourists became lost near the park’s Los Perros camp, reachable only by a four- to five-hour trek from the closest accessible point by vehicle.\nNovember is late spring in the southern hemisphere, with the busiest months in Torres del Paine coming in the summer months between December and February.\nChile’s president, Gabriel Boric, offered his condolences to the victims’ families in the “tragedy”, and paid tribute to the rescue teams who had “worked tirelessly from the very beginning in the search, rescue, and now evacuation efforts”.\nA spokesperson from the Foreign, Commonwealth and Development Office could not yet confirm the identity of the woman, but said: “We are in contact with the local authorities following an incident in Chile.”",
  "summary": null,
  "authors": [
    "Matty Edwards",
    "www.theguardian.com",
    "matty-edwards"
  ],
  "url": "https://www.theguardian.com/world/2025/nov/18/british-woman-among-four-tourists-killed-in-blizzard-at-nature-reserve-in-chile",
  "date_publish": "2025-11-18 22:53:36",
  "source_domain": "www.theguardian.com"
}