{
  "title": "Lebanon says Israeli strike killed 13 people near Palestinian refugee camp",
  "maintext": "At least 13 people have been killed in an Israeli strike near a Palestinian refugee camp in southern Lebanon, the country's health ministry says.\nThe Israeli military said it had targeted members of the Palestinian armed group Hamas \"operating in a training compound... in the Ein el-Hilweh area\".\nIt said the location was used by Hamas to plan and carry out attacks against Israel, which Hamas rejected as \"fabrication and lies\".\nIsrael has carried out regular air strikes on people and places in Lebanon since a deal to end the conflict with the Iran-backed armed group Hezbollah. Most strikes have targeted Hezbollah but Israel has also attacked Hamas in the country.\nAs well as those killed, Lebanon's health ministry said at least four people had been injured in the strike.\nImages showed emergency workers at the entrance of Ein el-Hilweh, the largest Palestinian refugee camp in Lebanon.\nFootage online also showed ambulances rushing through the narrow streets of the crowded camp as a huge plume of smoke billowed from the location hit.\nInitial reports said the strike hit an area outside a mosque that is usually busy at night.\nCondemning the attack, Hamas said it had \"no military installations in the Palestinian camps in Lebanon\" and that the site targeted was an \"open sports field\".\nIn its statement, the IDF said \"prior to the strike, measures were taken to reduce the chance of harm to civilians, including the use of precision munitions, aerial observations, and additional intelligence information\".\nHamas attacked southern Israel from Gaza on 7 October 2023, killing about 1,200 people and taking 251 others as hostages. Israel's military response has killed at least 69,169 Palestinians in Gaza, according to the territory's Hamas-run health ministry.\nFighting between Israel and Hezbollah escalated after the Lebanese group fired rockets at Israeli positions the day after 7 October 2023. Hezbollah said it was acting in solidarity with Palestinians in Gaza.\nIsrael and Hezbollah fought an escalating conflict for 13 months that culminated in an intense Israeli bombing campaign and ground incursion into southern Lebanon in October 2024.\nLebanese authorities said Israel's attacks killed about 4,000 people there - including many civilians - and led to the displacement of more than 1.2 million residents. Israeli authorities said more than 80 of its soldiers and 47 of its civilians were killed in the hostilities.",
  "summary": null,
  "authors": [
    "Sam Hancock"
  ],
  "url": "https://www.bbc.com/news/articles/c0l73j781y9o?at_medium=RSS&at_campaign=rss",
  "date_publish": "2025-11-18 21:33:21",
  "source_domain": "www.bbc.com"
}