{
  "title": "The Ashes: England name Shoaib Bashir in squad for first Perth Test against Australia",
  "maintext": "England have kept their options open for the first Ashes Test by naming off-spinner Shoaib Bashir in a 12-man squad alongside five pace bowlers.\nMark Wood has been passed fit and seems set to play against Australia in Perth on Friday, with the final decision probably between off-spinner Bashir and seamer Brydon Carse.\nIf England opt for an all-pace attack - four specialists plus all-rounder Ben Stokes - it would arguably be the fastest group of bowlers they have fielded in an Ashes Test in this country.\nOn Wednesday Western Australia pitch curator Isaac McDonald said to expect \"pace and bounce\" from the surface at Perth Stadium, and it seems likely England will stick to a long-standing plan of an exclusively pace attack.\nBut the tourists have also noted a dryness to the pitch, bringing Bashir into contention.\nIn the short history of this venue - five previous Tests have been staged here - Australia off-spinner Nathan Lyon is the leading wicket-taker with 29.\nEngland have backed Bashir, 22, as their first-choice spinner for more than a year and in May he became the youngest England bowler to reach 50 wickets in Tests.\nBut he has not played a competitive game since taking the final wicket in a dramatic victory over India in the third Test at Lord's in July.\nBashir has been out with a broken finger and struggled in England's only warm-up match against England Lions, returning combined figures of 2-151 from 24 overs.\nIt also raises the prospect of Bashir playing in an Ashes Test without being attached to a county. His contract at Somerset expired at the end of the home summer.\nHowever, an England team containing Wood, Jofra Archer, Gus Atkinson, captain Stokes and Carse - all of whom are capable of reaching 90mph - remains the most likely outcome.\nThe first Test starts at 02:20 GMT on Friday, with live text coverage, Test Match Special commentary and in-play highlights on the BBC Sport website.\nAlthough a number of England Ashes triumphs at home and abroad have been built on pace, they have never fielded as many express pace bowlers in the same team.\nThe side that won at home in the famous series of 2005 included Steve Harmison, Simon Jones and Andrew Flintoff.\nRaymond Illingworth's triumphant visitors to Australia in 1970-71 had Bob Willis, Peter Lever and John Snow, and the England team that won in 1954-55 included Brian Statham and Frank 'Typhoon' Tyson.\nPerhaps England's most famous Australian tour of all, the 1932-33 Bodyline series, caused diplomatic tensions between the two countries for a short-bowling plan designed to unsettle the great Don Bradman.\nOn this occasion - one of the most eagerly anticipated Ashes series in recent memory - England are looking to reverse an awful record - they have not won a Test in Australia since 2011.\nOnly five members of the 16-man squad have played a Test in Australia, but Atkinson says that could work in England's favour.\n\"It could be an advantage,\" he told BBC Sport. \"There are a lot of players who have said they have had some tough times here in Australia.\n\"For us, we are a very relaxed, very positive group. No scarring. It's very exciting. We all see it as a huge opportunity to do something special.\"\nAustralia's net session on Wednesday was briefly delayed by the threat of lightning.\nThe home side are expected to give a debut to opener Jack Weatherald, with uncapped pace bowler Brendan Doggett also coming in following injuries to captain Pat Cummins and and fellow seamer Josh Hazlewood.",
  "summary": null,
  "authors": [
    "Stephan Shemilt",
    "www.facebook.com"
  ],
  "url": "https://www.bbc.com/sport/cricket/articles/cdjr1vk1d34o?at_medium=RSS&at_campaign=rss",
  "date_publish": "2025-11-19 08:00:22",
  "source_domain": "www.bbc.com"
}