{
  "title": "Curacao become smallest nation to qualify for World Cup",
  "maintext": "The tiny Caribbean island of Curacao has become the smallest nation to ever qualify for the World Cup after drawing with Steve McClaren's Jamaica.\nThe record was held by Iceland, who reached the 2018 finals, but their country is far bigger than Curacao, which has a population of just over 150,000 (similar to Cambridge or Huddersfield) and a land area of 171 square miles, smaller than the Isle of Man.\nFormer England boss McClaren resigned as Jamaica boss after his side, who needed a win in Kingston to qualify for their first World Cup since 1998, were held to a goalless draw, including having an injury-time penalty overruled by VAR.\nCuracao boss Dick Advocaat, who was not at the game for personal reasons, will become the oldest coach at a World Cup, aged 78, beating Otto Rehhagel's record when he was in charge of Greece aged 71 in 2010.\nCuracao, 37 miles off the Venezuela coast, only became a country within the Kingdom of the Netherlands in 2010, following the dissolution of the Netherlands Antilles.\nTen years ago they were 150th in Fifa's world rankings. Now they are 82nd.\nThe expanded 2026 World Cup format, which features 48 nations instead of 32, along with the fact hosts Canada, Mexico and the United States all qualify automatically, has given Curacao a much-improved chance as they become the fourth debutant at next summer's tournament - joining Cape Verde, Uzbekistan and Jordan.\n\"It's crazy and would be one of the biggest things that will happen to Curacao,\" said midfielder Juninho Bacuna, a former Huddersfield, Rangers and Birmingham player before the match.\nSpeaking to BBC Radio 5 Live, he added: \"It's incredible and amazing. Even a few years ago you would not even think about it.\n\"To be personally part of it and to make that dream come true would be incredible.\"\nIn 10 qualifying matches, they have won seven and finished their campaign unbeaten.\nTheir fairytale looked shattered in the fourth of the five minutes added on at the end of the game when Curacao substitute Jeremy Antonisse appeared to have brought down Isaac Hayden and the El Salvador referee Ivan Barton immediately pointed to the spot.\nBut the referee was quickly encouraged by the VAR officials to check the incident on the small touchline screen and reversed his own decision to the consternation of the crowd.\nThey will be joined at the World Cup by Haiti and Panama from the Conacaf qualifying, with Jamaica having to go into the Intercontinental play-offs.\nThe Caribbean Island of Haiti sealed their place at a first World Cup since 1974 after defeating Nicaragua 2-0.\nSince January 2024, Dutchman Advocaat, 78, has been in charge of his eighth national side after three spells with the Netherlands, as well as coaching the United Arab Emirates, South Korea, Belgium, Russia, Serbia and Iraq.\nHe helped the Netherlands reach the quarter-finals of the 1994 World Cup and his South Korean team went out in the group phase in 2006.\nHis list of clubs managed includes PSV Eindhoven, Rangers, Zenit St Petersburg, Sunderland and Feyenoord.\nAdvocaat only became Curacao boss after a payment dispute between the players and the country's football association was resolved, and he immediately set his sights on qualifying for the 2026 World Cup.\n\"Everyone knows Dick Advocaat is a big name, he is a big coach and everyone respects him in his decisions and the way he works,\" added Bacuna. \"His presence is really important for us as a team and also for the country, and his impact has been really big.\n\"We started working with him in qualifying for the Nations League and we saw a growth in the team in the way we worked and the way we fought in games.\"",
  "summary": null,
  "authors": [
    "Andy Cryer",
    "www.facebook.com"
  ],
  "url": "https://www.bbc.com/sport/football/articles/c14p3dmdld1o?at_medium=RSS&at_campaign=rss",
  "date_publish": "2025-11-19 06:22:38",
  "source_domain": "www.bbc.com"
}